[{"DATE":"0707","YEAR":"19","AGENCY":"Department of Homeland Security","OFFICE":"Customs and Border Protection","LOCATION":"Procurement Directorate - DC","ZIP":"20229","CLASSCOD":"63","NAICS":"561613","OFFADD":"1300 Pennsylvania Avenue, N.W., Room 1310 NP Washington DC 20229","SUBJECT":"Smart Safe","SOLNBR":"HSBP20113688","RESPDATE":"071419","CONTACT":"Joseph Ohene, Contracting Officer, Email Joseph.Ohene@dhs.gov","DESC":"US Customs &amp; Border Protection (CBP) intends to solicit offers for a Smart Safe cash management solution that shall include the following:<br /><br />Smart Safe equipment and hardware installation and removal, maintenance and support services, courier services and banking services. The Smart Safe solution shall include equipment and hardware that store and secure U.S. currency and checks. The solution may include a variety of Smart Safe models and at a minimum a recycler model Smart Safe and/or a deposit-only model. Desired features of the Smart Safe cash management solution shall include cash counters, coin counters, verification of the currency (i.e., counterfeit detection), capacity to store cash and coins, and direct electronic transmission of deposit details to an authorized Treasury General Account (TGA) bank for account settlement. Overall, the Smart Safe cash management solution shall involve:\r\n<p>(a) Provision of Smart Safe equipment/hardware maintenance, help desk support, training for CBP employees, and training materials-all related to the Smart Safe.</p>\r\n<p>(b) Provision of Courier services (access Smart Safe to count, transport, and deposit funds in bank).</p>\r\n<p>(c) Provision of Banking services (change orders, vault services).(c) Provision of Banking services (change orders, vault services).</p>\r\n<p>CBP intends to solicit the Smart Safe acquisition on a full and open competition basis. A formal solicitation is forthcoming and will soon be released on FedBizOpps.</p>\r\n<p>&nbsp;</p>","LINK":"","URL":"https://www.fbo.gov/spg/DHS/USCS/PDDC20229/HSBP20113688/listing.html","DESC2":"Link To Document","SETASIDE":"N/A","POPCOUNTRY":"US","POPADDRESS":"Tucson and El Paso Field offices"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Homeland Security","OFFICE":"Customs and Border Protection","LOCATION":"Procurement Directorate - DC","ZIP":"20229","CLASSCOD":"63","NAICS":"561613","OFFADD":"1300 Pennsylvania Avenue, N.W., Room 1310 NP Washington DC 20229","SUBJECT":"Smart Safe","SOLNBR":"HSBP20113715","RESPDATE":"071419","CONTACT":"Joseph Ohene, Contracting Officer, Email Joseph.Ohene@dhs.gov","DESC":"&nbsp;&nbsp;&nbsp;&nbsp;<br />US Customs &amp; Border Protection (CBP) intends to solicit offers for a Smart Safe cash management solution that shall include the following: <br /><br />Smart Safe equipment and hardware installation and removal, maintenance and support services, courier services and banking services. The Smart Safe solution shall include equipment and hardware that store and secure U.S. currency and checks. The solution may include a variety of Smart Safe models and at a minimum a recycler model Smart Safe and/or a deposit-only model. Desired features of the Smart Safe cash management solution shall include cash counters, coin counters, verification of the currency (i.e., counterfeit detection), capacity to store cash and coins, and direct electronic transmission of deposit details to an authorized Treasury General Account (TGA) bank for account settlement. Overall, the Smart Safe cash management solution shall involve:<br /><br />(a) Provision of Smart Safe equipment/hardware maintenance, help desk support, training for CBP employees, and training materials-all related to the Smart Safe.<br /><br />(b) Provision of Courier services (access Smart Safe to count, transport, and deposit funds in bank).<br /><br />(c) Provision of Banking services (change orders, vault services).<br /><br />CBP intends to solicit the Smart Safe acquisition on a full and open competition basis. A formal solicitation is forthcoming and will soon be released on FedBizOpps.","LINK":"","URL":"https://www.fbo.gov/spg/DHS/USCS/PDDC20229/HSBP20113715/listing.html","DESC2":"Link To Document","SETASIDE":"N/A","POPCOUNTRY":"US","POPADDRESS":"San Francisco, Los Angeles and San Diego Field offices"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime","ZIP":"43216-5000","CLASSCOD":"54","NAICS":"332999","OFFADD":"P O Box 3990 Columbus OH 43216-5000","SUBJECT":"UMM TEST STANDS","SOLNBR":"SPMYM119Q0085","RESPDATE":"071619","ARCHDATE":"08312019","CONTACT":"Beverly D. Hines, Contract Specialist, Phone 7573961163, Email beverly.d.hines@navy.mil","DESC":"&nbsp;\r\n<p style=\"MARGIN-BOTTOM: 15pt; LINE-HEIGHT: 16.8pt\"><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \">The Defense Logistics Agency, DLA Maritime Norfolk, Norfolk Naval Shipyard Contracting Division, intends to negotiate a Firm Fixed Price, 100% small business set-aside contract to procure UMM TEST STANDS BUILT TO DWG 8283254, QTY 12 (see solicitation for details) to be delivered to the Norfolk Naval Shipyard, Portsmouth, VA.<span style=\"mso-spacerun: yes\">&nbsp; </span>The North American Industry Classification System (NAICS) code is 332999</span></p>\r\n<p style=\"MARGIN-BOTTOM: 15pt; LINE-HEIGHT: 16.8pt\"><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \">This procurement will be processed in accordance with Federal Acquisition Regulation (FAR) Subpart 13, Simplified Acquisition Procedures. The solicitation number is SPMYM1-19-Q-0085 and it is expected to be posted on or around 08 July 2019. Quotes will be due by 01:00 PM EDT on 16 July 2019 and may be emailed to the attention of Beverly D. Hines at Beverly.d.hines@navy.mil. All questions must be email to </span><a><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \">Beverly.d.hines@navy.mil</span></a><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \"> by 10 July 19 @ 1100 AM., no questions will be accepted after this date and time.<span style=\"mso-spacerun: yes\">&nbsp; </span><strong style=\"mso-bidi-font-weight: normal\">Please make sure that the solicitation number (SPMYM1-19-Q-0085) is included in the subject line of any email correspondence. Emails without subject lines will not be read because of security issues. Vendors must answer all evaluation factors for their bids to be considered viable. </strong></span></p>\r\n<p style=\"MARGIN-BOTTOM: 15pt; LINE-HEIGHT: 16.8pt\"><strong style=\"mso-bidi-font-weight: normal\"><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \">&nbsp;Award will be based on Lowest Price Technical Acceptable (LPTA) .</span></strong></p>\r\n<p><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \">Vendors are hereby notified that the solicitation and any subsequent amendments to the solicitation will only be available by downloading the documents at </span><a href=\"https://www.fbo.gov\"><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \">https://www.fbo.gov</span></a><span style=\"FONT-SIZE: 10pt; FONT-FAMILY: \"> (Federal Business Opportunities). By submitting a quote, the vendor will be self-certifying that neither it nor its principal corporate officials and owners are currently suspended, debarred, or otherwise ineligible to receive contracts from any Federal agency.</span></p>","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC/SPMYM119Q0085/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"23709","POPADDRESS":"NORFOLK NAVAL SHIPYARD\r\nBLDG 276\r\nRECEIVING OFFICER\nPORTSMOUTH, VA"},{"DATE":"0707","YEAR":"19","AGENCY":"Agency for International Development","OFFICE":"Overseas Missions","LOCATION":"Jordan USAID-Amman","ZIP":"09892-0206","CLASSCOD":"R","NAICS":"541990","OFFADD":"Unit #70206 APO AE 09892-0206","SUBJECT":"Women's Economic Empowerment and Leadership Activity","SOLNBR":"72027819R00010","RESPDATE":"072619","CONTACT":"Diana Khoury, Acquisition and Assistance Specialist, Phone 0096265906666, Email dkhoury@usaid.gov","DESC":"The Women Economic Empowerment and Leadership Activity (WEELA) will contribute to increasing women's access to employment and leadership in Jordan by improving women's access to the job market, enhancing the workforce enabling environment, and addressing inequalities and prohibitive social norms and traditions. <br />","LINK":"","URL":"https://www.fbo.gov/spg/AID/OM/JOR/72027819R00010/listing.html","DESC2":"Link To Document","SETASIDE":"N/A","POPCOUNTRY":"JO","POPADDRESS":"The Hashemite Kingdom of Jordan (Jordan)."},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"US Army Corps of Engineers","LOCATION":"USACE District, Fort Worth","ZIP":"76102-0300","CLASSCOD":"Z","NAICS":"236220","OFFADD":"Attn:  CESWF-CT\r\nPO Box 17300 Fort Worth TX 76102-0300","SUBJECT":"Buildings 1717 & 1735 renovation","SOLNBR":"W9126G19B0010","CONTACT":"Eugene A. Gibbs, Contract Specialist, Phone 8178861069, Email Eugene.a.gibbs@usace.army.mil","DESC":"This is not a solicitation. An Invitation for Bid (IFB) solicitation will be issued between Tuesday the 23rd of July and Monday the 19th of August 2019.\r\n<div><br />&nbsp;\r\n<p>CONTRACT INFORMATION: This announcement is for a 100% small business set aside acquisition to renovate Buildings 1717 &amp; 1735 at Fort Bliss, TX.  The North American Industrial Classification System code is 236220, which has a size standard of $36.5 million. A firm-fixed price contract is anticipated to be awarded in September 2019. To be eligible for contract award, a firm must be registered with the System for Award Management (SAM) database. Register via the SAM Internet site at https://www.sam.gov/. No state level certifications will be accepted. Award will be made to the lowest, responsible bidder whose bid, conforming to the invitation for bid, will be the most advantageous to the government. Anticipated project completion date is 365 days from Notice to proceed.</p>\r\n<p>PROJECT INFORMATION: Construction range is between $10,000,000 and $25,000,000. This contract is a Design Bid Build for renovation of Buildings 1717 &amp; 1735 at FT. Bliss, TX. The objective of this project is to renovate Building 1717 at Fort Bliss, TX to provide administrative space with functional areas (e.g. physical exams) for the U.S. Army Support Soldier Readiness and Resiliency Center (SRRC). Building 1735 will serve as a meeting/conference/briefing area.</p>\r\n<p>Renovation portion of Building 1717 is a 61,000 gross square foot (GSF), one-story building with the north end having a second story section originally constructed in 1980.  Originally built as a commissary, Building 1717 is now being used as a training, vendor, and issuing activities building.</p>\r\n<p>The broad view of the project is to renovate the building(s) for function areas such as rooms for physical exams, administrative space, in the first and second floors. Specific scope elements include:</p>\r\n<p>Architectural renovations to include: Exterior Walls, Windows, Doors, Roof Coverings and Openings, Interior Partitions, Doors, Fittings, Wall, Floor, Ceiling Finishes, Signage, Furnishing, and Equipment.</p>\r\n<p>Structural:<br />New and existing partitions, roof, HVAC and FFE.</p>\r\n<p>Mechanical:<br />Will provide HVAC, plumbing, drainage.</p>\r\n<p>Electrical/ Communication: Lightning protection system, Emergency Generation, Energy Efficient Lighting and Branch Wiring, Electrical service and Distribution, Communication: Voice/ Data, Security: Intrusion Detection System and Duress Alarm System</p>\r\n<p>Fire Protection: Fire Suppression System, Fire Detection, Fire Alarm and Signal, Mass Notification</p>\r\n<p>After solicitation issuance, contractors may view and/or download this solicitation, specifications and all amendments at the following internet addresses: Federal Business Opportunities (FBO) Website (www.fbo.gov). Type in the search box the solicitation number W9126G19B0010. The use of the websites requires prior registration. Plans and specifications will NOT be made available in paper format or on compact disc. It is the Offerors responsibility to monitor the FedBizOps website and or any other official government website for amendments to the solicitation. You must be registered with the SAM, to receive a Government contract award.</p>\r\n<p>The Primary Point of Contract for this project is Eugene A. Gibbs, Contract Specialist, email is Eugene.A.Gibbs@usace.army.mil. All questions MUST be received through email for record. The Government reserves the right to use only the Internet as notification of any amendments to this solicitation. It is the offerors responsibility to view the websites daily for amendments to the solicitation. Accordingly, prospective contractors may view and/or download the solicitation and all amendments from the FedBizOps address after solicitation issuance. Contractors shall register themselves at this website under the solicitation number to receive a copy of the solicitation.</p>\r\n</div>","LINK":"","URL":"https://www.fbo.gov/spg/USA/COE/DACA63/W9126G19B0010/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"79906","POPADDRESS":"Fort Bliss\nEl Paso, TX"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Long Beach VANLO","LOCATION":"Department of Veterans Affairs","ZIP":"90815","CLASSCOD":"70","NAICS":"511210","OFFADD":"Department of Veterans Affairs;Network Contracting Office 22;4811 Airport Plaza Drive;Suite 600;Long Beach CA  90815","SUBJECT":"70--Cerebus System Digital","SOLNBR":"36C26219Q0945","RESPDATE":"071219","ARCHDATE":"09102019","CONTACT":"Ryan Singletary\nRyan.Singletary@va.gov\n\n<a href=\"mailto:Ryan.Singletary@va.gov\">Ryan.Singletary@va.gov</a>","DESC":"Responses must be received no later than Friday, July 12, 2019 at 12:00 p.m. PST.\nTHIS REQUEST FOR INFORMATION (RFI) IS ISSUED SOLELY FOR INFORMATION AND PLANNING PURPOSES ONLY AND DOES NOT CONSTITUTE A SOLICITATION. \nTHE SUBMISSION OF PRICING, CAPABILITIES FOR PLANNING PURPOSES, AND OTHER MARKET INFORMATION IS HIGHLY ENCOURAGED AND ALLOWED UNDER THIS RFI IN ACCORDANCE WITH (IAW) FAR 15.201(e).\nDISCLAIMER: This RFI is issued solely for information and planning purposes only and does not constitute a solicitation. All information received in response to this RFI that is marked as proprietary will be handled accordingly. IAW FAR 15.201(e), responses to this notice are not offers and cannot be accepted by the Government to form a binding contract. Responders are solely responsible for all expenses associated with responding to this RFI.\nSOURCES SOUGHT DESCRIPTION\nThis is NOT a solicitation announcement. This is a sources sought/RFI only. The purpose of this sources sought/RFI is to gain knowledge of potential qualified sources and their size classification relative to NAICS 511210. Responses to this sources sought will be used by the Government to make appropriate acquisition decisions. After review of the responses to this sources sought, a solicitation announcement may be published. Responses to this sources sought synopsis are not considered adequate responses for a solicitation announcement.\nThe Department of Veterans Affairs (VA), VISN 22 Network Contracting Office, is seeking sources that can provide a Cerebus System that at a minimum meets the following salient characteristics with a brand name or equal product for the VA San Diego Healthcare System:\nLine 1 \n7193\nCerebus System Digital, 128-ch real-time data acquisition system, 110-120 V \nCerebus System: High performance rack-mountable Digital Neural Signal Processor with auxiliary I/O (16-ch analog ins, 4-ch analog outs, 16-ch digital ins, 4-ch digital outs, 2-ch audio outs, RS-232 serial, sync), Includes complete software package with networking capability for up to 16 PCs, online and offline software development kits (SDKs) for MATLAB and C++ environments, Digital Hub optical isolator, all cables. Does not include headstages.\nQuantity: 1\n\nLine 2\n7351\nCable, HDMI A/A 5m. Extension cable for CerePlex family of amplifiers.\nQuantity: 1\n\nLine 3\n8547 \nAdaptor, HDMI A to HDMI A coupler. HDMI A/A coupler for extending length of HDMI cables.\nQuantity: 1\n\nLine 4\n8068 \nCerePlex, Cable, ultrathin HDMI A/D, 2.5 ft, modified. For use with CerePlex E/M headstages\nQuantity: 1\n\nLine 5\n10510 \nCerePlex, Headstage E-series, CerePort Plug, 128-ch. Includes a 3-Yr accidental damage coverage.\nQuantity: 1\n\nLine 6\n8991 Cable, HDMI A/A 3 ft. For use with CerePlex A/I/W amplifiers.\nQuantity: 1\n\nLine 7\n9660 \nCerePlex, W-Series, 8-Antenna, Digital wireless receiver, 128-ch\nQuantity: 1\n\nLine 8\n9583\nCerePlex W-series digital wireless transmitter, 96-ch, v2. CerePlex W digital wireless transmitter.\nQuantity: 1\n\nLine 9 \n8282 \nNSS, Digital Neural Signal Simulator with multiple connectors, v 2.0. For testing and troubleshooting the system.\nQuantity: 1\n\nLine 10\n1025 Array, CerePort, Elec length 1.5 mm, Platinum tips, 400 um pitch\nQuantity: 10 \n\nLine 11\n7280 Inserter, System, Control unit, wand assembly, trigger assembly, spacers for 0.6, 1.0, 1.5 mm arrays, 110-120 V For implanting the Utah Array.\nQuantity: 1\n\nLine 12\n10585 Service, Premium Service Contract, Lab, 1-Year One year of onsite support. This includes two on-demand visits from Support Engineers for training, support, troubleshooting, or standby during important experiments.\nQuantity: 5\n\nLine 13\n10587 \nService, Extended Warranty Advance Replacement: Digital Cerebus System one year\nAdvanced replacement of any malfunctioning components of the Digital Cerebus system and up to three headstages. \nQuantity: 5\n\nLine 14\n10591 Service, Extended Warranty Advance Replacement: Wireless System one Year Advanced replacement of any malfunctioning components of the Digital Cerebus system and up to three headstages. \nQuantity: 5\n\nThe information identified above is intended to be descriptive, not restrictive and to indicate the quality of the supplies/services that will be satisfactory. It is the responsibility of the interested source to demonstrate to the government that the interested parties can provide the supplies/services that fulfill the required specifications. If you are interested, and are capable of providing the sought out supplies/services, please provide the requested information as well as the information indicated below. \nIf you are interested, and are capable of providing the sought out supplies/services, please provide the requested information as well as the information indicated below. Response to this notice should include company name, address, point of contact, size of business pursuant to the following questions:\n(1) Please indicate the size status and representations of your business, such as but not limited to: Service Disabled Veteran Owned Small Business (SDVOSB), Veteran Owned Small Business (VOSB), Hubzone, Woman Owned Small Business (WOSB), Large Business, etc.\n(2) Is your company considered small under the NAICS code identified under this RFI?\n(3) Are you the manufacturer or distributor of the items being referenced above (or equivalent product/solution)? What is the manufacturing country of origin of these items?\n(4) If you re a small business and you are an authorized distributor/reseller for the items identified above (or equivalent product/solution), do you alter; assemble; modify; the items requested in any way? If you do, state how and what is altered; assembled; modified?\n(5) Does your company have an FSS contract with GSA or the NAC or are you a contract holder with NASA SEWP or any other federal contract? If so, please provide the contract type and number.\n(6) If you are an FSS GSA/NAC or NASA SEWP contract holder or other federal contract holder, are the referenced items/solutions available on your schedule/contract?\n(7) Please provide general pricing for your products/solutions for market research purposes.\n(8) Please submit your capabilities in regards to the salient characteristics being provided and any information pertaining to equal to items to establish capabilities for planning purposes?\n*** Submissions addressing Section (8) should show clear, compelling and convincing*** evidence that all equal to items\" meet all required salient characteristics.\nResponses to this notice shall be submitted via email to Ryan.Singletary@va.gov. Telephone responses shall not be accepted. Responses must be received no later than Friday, July 12, 2019 at 12:00 p.m. PST. If a solicitation is issued it shall be announced at a later date, and all interested parties must respond to that solicitation announcement separately from the responses to this request for information. Responses to this notice are not a request to be added to a prospective bidders list or to receive a copy of the solicitation.","LINK":"","URL":"https://www.fbo.gov/spg/VA/LBVANBC/VAMD/36C26219Q0945/listing.html","DESC2":"Link To Document","EMAIL":"","EMAIL2":"Ryan.Singletary@va.gov","DESC3":"Ryan.Singletary@va.gov","SETASIDE":"N/A","POPCOUNTRY":"USA","POPZIP":"92161","POPADDRESS":"Department of Veterans Affairs;VA San Diego Healthcare System;Attn; Warehouse;3350 La jolla Village Drive;San Diego, CA"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"53","NAICS":"488190","OFFADD":"488190","SUBJECT":"53--PLATE ID","SOLNBR":"SPE4A119U0024","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5360LN0020383 PLATE ID:\nLine 0001 Qty 215.0  UI EA  Deliver To: DLA DISTRIBUTION JACKSONVILLE By: 0084 DAYS ADOApproved source is 78567 SPL23364.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A119U0024/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"31","NAICS":"332991","OFFADD":"332991","SUBJECT":"31--BEARING,SLEEVE","SOLNBR":"SPE4A419T8323","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 3120014067789 BEARING,SLEEVE:\nLine 0001 Qty 31.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0087 DAYS ADOApproved source is 16746 JJ96A-200-1.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A419T8323/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"31","NAICS":"332991","OFFADD":"332991","SUBJECT":"31--BEARING,BALL,ANNULA","SOLNBR":"SPE4A419U0075","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 3110008176127 BEARING,BALL,ANNULA:\nLine 0001 Qty 528.0  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0384 DAYS ADOApproved sources are 4LSH0 10841-2; 63395 10841-2.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A419U0075/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"16","NAICS":"336411","OFFADD":"336411","SUBJECT":"16--RETAINER,CABLE,LOWE","SOLNBR":"SPE4A719T447H","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1660001373894 RETAINER,CABLE,LOWE:\nLine 0001 Qty 28.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0100 DAYS ADOApproved source is 04577 133-700179-1.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A719T447H/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"15","NAICS":"336413","OFFADD":"336413","SUBJECT":"15--SUPPORT,STRUCTURAL","SOLNBR":"SPE4A719T447M","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1560015150147 SUPPORT,STRUCTURAL:\nLine 0001 Qty 19.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0914 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0331 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A719T447M/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"28","NAICS":"336412","OFFADD":"336412","SUBJECT":"28--SUPPORT ASSEMBLY,CO","SOLNBR":"SPE4A019T2267","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2840010379318 SUPPORT ASSEMBLY,CO:\nLine 0001 Qty 9.000  UI EA  Deliver To: THE 2ND SUPPLY DEPOT By: 0005 DAYS ADOApproved sources are 63005 6890530; 73342 6890530.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A019T2267/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"15","NAICS":"336413","OFFADD":"336413","SUBJECT":"15--PLATE,STRUCTURAL,AI","SOLNBR":"SPE4A519T705K","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1560012344083 PLATE,STRUCTURAL,AI:\nLine 0001 Qty 2.000  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0193 DAYS ADOLine 0002 Qty 49.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0193 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A519T705K/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"16","NAICS":"336413","OFFADD":"336413","SUBJECT":"16--PISTON,LINEAR ACTUA","SOLNBR":"SPE4A719T447L","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1650001597749 PISTON,LINEAR ACTUA:\nLine 0001 Qty 39.00  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0764 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0431 DAYS ADOLine 0003 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0734 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A719T447L/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"16","NAICS":"331491","OFFADD":"331491","SUBJECT":"16--DUCT ASSEMBLY,AIR C","SOLNBR":"SPE4A719T447N","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1660011626547 DUCT ASSEMBLY,AIR C:\nLine 0001 Qty 15.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT OKLAHOMA By: 0150 DAYS ADOApproved source is 98769 1808248-101.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A719T447N/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"61","NAICS":"334419","OFFADD":"334419","SUBJECT":"61--CABLE ASSEMBLY,SPEC","SOLNBR":"SPE4A619T31A9","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6150014447144 CABLE ASSEMBLY,SPEC:\nLine 0001 Qty 49.00  UI EA  Deliver To: DLA DISTRIBUTION CHERRY POINT By: 0417 DAYS ADOThis is a source controlled drawing item.  Approved sources are 59501 420970; 97499 901-376-818-107.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. The items furnished must meet the requirements of the drawing cited in the solicitation. Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A619T31A9/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"16","NAICS":"336413","OFFADD":"336413","SUBJECT":"16--STRAP ASSY,AIRCRAFT","SOLNBR":"SPE4A719T448J","RESPDATE":"080919","ARCHDATE":"09082019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1680015026122 STRAP ASSY,AIRCRAFT:\nLine 0001 Qty 38.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0189 DAYS ADOThis is a source controlled drawing item.  Approved source is 64344 901-376-822-115.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. The items furnished must meet the requirements of the drawing cited in the solicitation. Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A719T448J/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"40","NAICS":"332618","OFFADD":"332618","SUBJECT":"40--WIRE ROPE ASSEMBLY,","SOLNBR":"SPE4A619U0501","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4010012900159 WIRE ROPE ASSEMBLY,:\nLine 0001 Qty 2.000  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0101 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A619U0501/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"59","NAICS":"444190","OFFADD":"444190","SUBJECT":"59--CABLE ASSEMBLY","SOLNBR":"SPE4A619T30Z5","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5995011368856 CABLE ASSEMBLY:\nLine 0001 Qty 10.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0217 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0157 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A619T30Z5/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","ZIP":"23297","CLASSCOD":"15","NAICS":"336413","OFFADD":"336413","SUBJECT":"15--LONGERON,LOWER","SOLNBR":"SPE4A719T448K","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1560012220589 LONGERON,LOWER:\nLine 0001 Qty 106.0  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0407 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0120 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCR-BSM/SPE4A719T448K/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"61","NAICS":"335312","OFFADD":"335312","SUBJECT":"61--MOTOR,ALTERNATING C","SOLNBR":"SPE7M019T057A","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6105012094693 MOTOR,ALTERNATING C:\nLine 0001 Qty 1.000  UI EA  Deliver To: USS NIMITZ CVN 68 By: 0005 DAYS ADOApproved source is 71956 86693.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M019T057A/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"29","NAICS":"333415","OFFADD":"333415","SUBJECT":"29--SEAL,FAN,SHROUD","SOLNBR":"SPE7L219T3546","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2930011023491 SEAL,FAN,SHROUD:\nLine 0001 Qty 1079.  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0139 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L219T3546/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"332911","OFFADD":"332911","SUBJECT":"48--DISK,VALVE","SOLNBR":"SPE7M119T427R","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4810013484557 DISK,VALVE:\nLine 0001 Qty 2.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0143 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T427R/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"332911","OFFADD":"332911","SUBJECT":"48--COCK,POPPET DRAIN","SOLNBR":"SPE7MC19T090F","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4820002039391 COCK,POPPET DRAIN:\nLine 0001 Qty 548.0  UI EA  Deliver To: DLA DISTRIBUTION JACKSONVILLE By: 0460 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION JACKSONVILLE By: 0090 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7MC19T090F/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"30","NAICS":"333612","OFFADD":"333612","SUBJECT":"30--CLUTCH,ONE WAY,FULL","SOLNBR":"SPE7L219T3544","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 3010010537799 CLUTCH,ONE WAY,FULL:\nLine 0001 Qty 51.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0218 DAYS ADOThis is a source controlled drawing item.  Approved sources are 99186 09007A; 99186 139007A.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. The items furnished must meet the requirements of the drawing cited in the solicitation. Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L219T3544/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"25","NAICS":"336350","OFFADD":"336350","SUBJECT":"25--YOKE,UNIVERSAL JOIN","SOLNBR":"SPE7L319T387B","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2520014597021 YOKE,UNIVERSAL JOIN:\nLine 0001 Qty 92.00  UI EA  Deliver To: DLA DISTRIBUTION BARSTOW By: 0129 DAYS ADOThis is a source controlled drawing item.  Approved source is 77873 02084406.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. The items furnished must meet the requirements of the drawing cited in the solicitation. Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T387B/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"10","NAICS":"336413","OFFADD":"336413","SUBJECT":"10--SUPPORT, RACK, BOMB.","SOLNBR":"SPE7L319T387J","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1095013078082 SUPPORT, RACK, BOMB.:\nLine 0001 Qty 10.00  UI EA  Deliver To: DIRECTOR OF DEPOT SUPPLY By: 0170 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: DIRECTOR OF DEPOT SUPPLY By: 0120 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T387J/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"61","NAICS":"335999","OFFADD":"335999","SUBJECT":"61--CONTACTOR,MAGNETIC","SOLNBR":"SPE7M119T427W","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6110015247172 CONTACTOR,MAGNETIC:\nLine 0001 Qty 5.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0149 DAYS ADOApproved sources are 74063 BH-494C; 99167 5913616.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T427W/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"59","NAICS":"334419","OFFADD":"334419","SUBJECT":"59--SWITCH,PRESSURE","SOLNBR":"SPE7M819T5773","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5930012148845 SWITCH,PRESSURE:\nLine 0001 Qty 25.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0411 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0030 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M819T5773/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"332911","OFFADD":"332911","SUBJECT":"48--LAMELLAR VALVE","SOLNBR":"SPE7MC19T089V","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4820015628898 LAMELLAR VALVE:\nLine 0001 Qty 56.00  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0164 DAYS ADOApproved source is 1KWT0 037158.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7MC19T089V/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"29","NAICS":"336412","OFFADD":"336412","SUBJECT":"29--HOUSING,OUTLET,FUEL","SOLNBR":"SPE7MC19T090D","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2915011114767 HOUSING,OUTLET,FUEL:\nLine 0001 Qty 44.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT OKLAHOMA By: 0174 DAYS ADOApproved source is 86090 42922-1.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7MC19T090D/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"25","NAICS":"336992","OFFADD":"336992","SUBJECT":"25--MOUNTING FRAME","SOLNBR":"SPE7L319T386T","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2590012776902 MOUNTING FRAME:\nLine 0001 Qty 3.000  UI EA  Deliver To: DLA DISTRIBUTION RED RIVER By: 0166 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T386T/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"10","NAICS":"332994","OFFADD":"332994","SUBJECT":"10--HOUSING ASSY","SOLNBR":"SPE7L319T387C","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1025015162476 HOUSING ASSY:\nLine 0001 Qty 6.000  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0278 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0090 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T387C/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"61","NAICS":"335312","OFFADD":"335312","SUBJECT":"61--ROTOR,MOTOR","SOLNBR":"SPE7M119T427V","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6105008584577 ROTOR,MOTOR:\nLine 0001 Qty 38.00  UI EA  Deliver To: DLA DISTRIBUTION JACKSONVILLE By: 0115 DAYS ADOApproved source is 82255 K13557.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T427V/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"43","NAICS":"333996","OFFADD":"333996","SUBJECT":"43--PUMP UNIT,CENTRIFUG","SOLNBR":"SPE7M119T427X","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4320012570818 PUMP UNIT,CENTRIFUG:\nLine 0001 Qty 19.00  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0017 DAYS ADOApproved source is 01413 118464.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T427X/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"43","NAICS":"333996","OFFADD":"333996","SUBJECT":"43--PUMP UNIT,CENTRIFUG","SOLNBR":"SPE7M119T428F","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4320012361232 PUMP UNIT,CENTRIFUG:\nLine 0001 Qty 6.000  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0045 DAYS ADOApproved source is 96046 10971-SP-1.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T428F/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"332911","OFFADD":"332911","SUBJECT":"48--VALVE,PLUG","SOLNBR":"SPE7MC19T089S","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4820011798795 VALVE,PLUG:\nLine 0001 Qty 12.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0164 DAYS ADOApproved sources are 38881 190-0022; 53424 M24509A20119LP.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7MC19T089S/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"332912","OFFADD":"332912","SUBJECT":"48--VALVE,REGULATING,FL","SOLNBR":"SPE7MC19T089W","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4820011840493 VALVE,REGULATING,FL:\nLine 0001 Qty 9.000  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0164 DAYS ADOApproved sources are 76301 75J838000-101; U1605 PAS129-172; U1605 PAS129-172-2.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7MC19T089W/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"43","NAICS":"333999","OFFADD":"333999","SUBJECT":"43--PARTS KIT,FLUID PRE","SOLNBR":"SPE7L319T386Z","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4330016741712 PARTS KIT,FLUID PRE:\nLine 0001 Qty 44.00  UI KT  Deliver To: W1A8 DLA DISTRIBUTION By: 0058 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T386Z/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"10","NAICS":"332994","OFFADD":"332994","SUBJECT":"10--TRAY ASSEMBL,FEED","SOLNBR":"SPE7L319T387F","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1005015472616 TRAY ASSEMBL,FEED:\nLine 0001 Qty 137.0  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0510 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0060 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T387F/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"30","NAICS":"333612","OFFADD":"333612","SUBJECT":"30--GEAR,INTERNAL","SOLNBR":"SPE7L419T3826","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 3020011149716 GEAR,INTERNAL:\nLine 0001 Qty 5.000  UI EA  Deliver To: DLA DISTRIBUTION CORPUS CHRISTI TX By: 0349 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION CORPUS CHRISTI TX By: 0060 DAYS ADOLine 0003 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION CORPUS CHRISTI TX By: 0169 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L419T3826/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"61","NAICS":"335912","OFFADD":"335912","SUBJECT":"61--RETAINER,BATTERY","SOLNBR":"SPE7L719T4920","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6160011018402 RETAINER,BATTERY:\nLine 0001 Qty 364.0  UI EA  Deliver To: DLA DISTRIBUTION RED RIVER By: 0118 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L719T4920/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"47","NAICS":"331210","OFFADD":"331210","SUBJECT":"47--TUBE ASSEMBLY,METAL","SOLNBR":"SPE7M419T9881","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4710010048907 TUBE ASSEMBLY,METAL:\nLine 0001 Qty 75.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0614 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0090 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M419T9881/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"332911","OFFADD":"332911","SUBJECT":"48--CAGE,VALVE","SOLNBR":"SPE7MC19T089X","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4820012538488 CAGE,VALVE:\nLine 0001 Qty 80.00  UI EA  Deliver To: DLA DISTRIBUTION JACKSONVILLE By: 0030 DAYS ADOApproved source is 86090 28588.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7MC19T089X/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"25","NAICS":"336390","OFFADD":"336390","SUBJECT":"25--EVAPORATOR,AIR BRAK","SOLNBR":"SPE7L319T386F","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2530016305913 EVAPORATOR,AIR BRAK:\nLine 0001 Qty 500.0  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0142 DAYS ADOApproved sources are 06721 N-50011-P; 75Q65 4114857.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T386F/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"25","NAICS":"336390","OFFADD":"336390","SUBJECT":"25--SPINDLE,DIFFERENTIA","SOLNBR":"SPE7L319T387D","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2530011724771 SPINDLE,DIFFERENTIA:\nLine 0001 Qty 18.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0171 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319T387D/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"25","NAICS":"336330","OFFADD":"336330","SUBJECT":"25--WHEEL,PNEUMATIC TIR","SOLNBR":"SPE7L319U0236","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2530016776205 WHEEL,PNEUMATIC TIR:\nLine 0001 Qty 85.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0149 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L319U0236/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"25","NAICS":"336390","OFFADD":"336390","SUBJECT":"25--PARTS KIT,MIRROR AS","SOLNBR":"SPE7L419T3827","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2540014939101 PARTS KIT,MIRROR AS:\nLine 0001 Qty 496.0  UI EA  Deliver To: DLA DISTRIBUTION RED RIVER By: 0184 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L419T3827/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"43","NAICS":"333996","OFFADD":"333996","SUBJECT":"43--STEAM CHEST ASSEMBL","SOLNBR":"SPE7M119T427Y","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4320012017176 STEAM CHEST ASSEMBL:\nLine 0001 Qty 1.000  UI AY  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0149 DAYS ADOApproved source is 63857 TB-29.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T427Y/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"59","NAICS":"334412","OFFADD":"334412","SUBJECT":"59--CIRCUIT CARD ASSEMB","SOLNBR":"SPE7M519Q1156","RESPDATE":"072319","ARCHDATE":"08222019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5998015798413 CIRCUIT CARD ASSEMB:\nLine 0001 Qty 68.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0220 DAYS ADOApproved source is 05257 12993563.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes may be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M519Q1156/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"53","NAICS":"339991","OFFADD":"339991","SUBJECT":"53--RETAINER,PACKING","SOLNBR":"SPE7M019T057Z","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5330015938834 RETAINER,PACKING:\nLine 0001 Qty 4.000  UI EA  Deliver To: NORFOLK NAVAL SHIPYARD GF By: 0005 DAYS ADOApproved source is 0EYA6 H76262-01/8.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M019T057Z/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"61","NAICS":"335312","OFFADD":"335312","SUBJECT":"61--QUILLSHAFT","SOLNBR":"SPE7M119T427D","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6115012798233 QUILLSHAFT:\nLine 0001 Qty 71.00  UI EA  Deliver To: DLA DISTRIBUTION CHERRY POINT By: 0182 DAYS ADOApproved sources are 3CTT2 85201214; U0J60 85201214; U4271 85201214.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T427D/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"47","NAICS":"326220","OFFADD":"326220","SUBJECT":"47--HOSE ASSEMBLY,NONME","SOLNBR":"SPE7M419T9874","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4720015587665 HOSE ASSEMBLY,NONME:\nLine 0001 Qty 4098.  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0177 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M419T9874/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"336413","OFFADD":"336413","SUBJECT":"48--POPPET-SLEEVE","SOLNBR":"SPE7M119T426Y","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4810003353097 POPPET-SLEEVE:\nLine 0001 Qty 49.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT OKLAHOMA By: 0090 DAYS ADOApproved sources are 09456 926-0086-050; 86090 125346A.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T426Y/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"17","NAICS":"333999","OFFADD":"333999","SUBJECT":"17--FITTING,PANEL LIFT","SOLNBR":"SPE7M219T4262","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1720002531867 FITTING,PANEL LIFT:\nLine 0001 Qty 37.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0143 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M219T4262/listing.html","DESC2":"Link To Document","SETASIDE":"HUBZone"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"59","NAICS":"335313","OFFADD":"335313","SUBJECT":"59--CIRCUIT BREAKER","SOLNBR":"SPE7M519T642A","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5925015396972 CIRCUIT BREAKER:\nLine 0001 Qty 152.0  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0172 DAYS ADOApproved source is 1TMY5 GFTCB230CS.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M519T642A/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"61","NAICS":"335911","OFFADD":"335911","SUBJECT":"61--BATTERY,STORAGE","SOLNBR":"SPE7L719T4916","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6140016617313 BATTERY,STORAGE:\nLine 0001 Qty 462.0  UI EA  Deliver To: DLA DISTRIBUTION RICHMOND By: 0118 DAYS ADOApproved source is 1B4X1 NNTN8930A.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L719T4916/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"59","NAICS":"335931","OFFADD":"335931","SUBJECT":"59--SWITCH,PRESSURE","SOLNBR":"SPE7M819U0038","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5930009699764 SWITCH,PRESSURE:\nLine 0001 Qty 45.00  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0296 DAYS ADOApproved source is 98505 1111.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M819U0038/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"61","NAICS":"335912","OFFADD":"335912","SUBJECT":"61--BATTERY,NONRECHARGE","SOLNBR":"SPE7L719T4915","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6135001683722 BATTERY,NONRECHARGE:\nLine 0001 Qty 50.00  UI EA  Deliver To: DLA DISTRIBUTION RICHMOND By: 0165 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: DLA DISTRIBUTION RICHMOND By: 0030 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7L719T4915/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"20","NAICS":"332510","OFFADD":"332510","SUBJECT":"20--RING,LOCKING","SOLNBR":"SPE7M119T427N","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 2040014866120 RING,LOCKING:\nLine 0001 Qty 1.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0158 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7M119T427N/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","ZIP":"43218-3990","CLASSCOD":"48","NAICS":"332911","OFFADD":"332911","SUBJECT":"48--VALVE,SAFETY RELIEF","SOLNBR":"SPE7MC19T089K","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4820013262763 VALVE,SAFETY RELIEF:\nLine 0001 Qty 1.000  UI EA  Deliver To: USS MITSCHER DDG 57 By: 0020 DAYS ADOApproved sources are 34889 D50959-VTN ITEM R10AQ2Q2AT-BM3; 34889 R10AQ2Q2AT-BM3.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCC-BSM/SPE7MC19T089K/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332510","OFFADD":"332510","SUBJECT":"53--BRACKET,MOUNTING","SOLNBR":"SPE5EK19T136J","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5340013456746 BRACKET,MOUNTING:\nLine 0001 Qty 110.0  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0073 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5EK19T136J/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332722","OFFADD":"332722","SUBJECT":"53--SCREW,CLOSE TOLERAN","SOLNBR":"SPE5E219T058F","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5305013909047 SCREW,CLOSE TOLERAN:\nLine 0001 Qty 3000.  UI EA  Deliver To: DLA DISTRIBUTION DEPOT OKLAHOMA By: 0185 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E219T058F/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332722","OFFADD":"332722","SUBJECT":"53--BRACKET,MOUNTING","SOLNBR":"SPE5E819T123G","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5340015525895 BRACKET,MOUNTING:\nLine 0001 Qty 39.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0128 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E819T123G/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"339991","OFFADD":"339991","SUBJECT":"53--SEAL,PLAIN ENCASED","SOLNBR":"SPE5EJ19T8045","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5330006799626 SEAL,PLAIN ENCASED:\nLine 0001 Qty 265.0  UI EA  Deliver To: DLA DISTRIBUTION ANNISTON By: 0166 DAYS ADOThis is a source controlled drawing item.  Approved source is 06YY8 132-0713.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. The items furnished must meet the requirements of the drawing cited in the solicitation. Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5EJ19T8045/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"339991","OFFADD":"339991","SUBJECT":"53--SEAL,NONMETALLIC SP","SOLNBR":"SPE5EJ19T8015","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5330014911343 SEAL,NONMETALLIC SP:\nLine 0001 Qty 57.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0169 DAYS ADOApproved sources are 0BBK9 165-7106786 PART 4; 96169 H341-3001 PART 4.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5EJ19T8015/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332722","OFFADD":"332722","SUBJECT":"53--PLATE,MOUNTING","SOLNBR":"SPE5EM19T8851","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5340013205582 PLATE,MOUNTING:\nLine 0001 Qty 76.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0344 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0180 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5EM19T8851/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332111","OFFADD":"332111","SUBJECT":"53--BOLT,SHOULDER","SOLNBR":"SPE5E419T111F","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5306014936725 BOLT,SHOULDER:\nLine 0001 Qty 2.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0169 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E419T111F/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"339991","OFFADD":"339991","SUBJECT":"53--SEAL,PLAIN ENCASED","SOLNBR":"SPE5EJ19T8026","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5330015351009 SEAL,PLAIN ENCASED:\nLine 0001 Qty 68.00  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0031 DAYS ADOApproved source is 0FCJ1 4441MFLR5750.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5EJ19T8026/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"339991","OFFADD":"339991","SUBJECT":"53--SEAL,NONMETALLIC SPECI","SOLNBR":"SPE5E319T292W","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5330010301535 SEAL,NONMETALLIC SPECI:\nLine 0001 Qty 248.0  UI EA  Deliver To: DLA DISTRIBUTION DEPOT OKLAHOMA By: 0282 DAYS ADOApproved source is 3DBN7 6915-2-127-12.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E319T292W/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332722","OFFADD":"332722","SUBJECT":"53--BOLT,MACHINE","SOLNBR":"SPE5E419T111X","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5306016653385 BOLT,MACHINE:\nLine 0001 Qty 35.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0116 DAYS ADOApproved source is 77272 724S3707-201.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E419T111X/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332510","OFFADD":"332510","SUBJECT":"53--PIN,SHOULDER,HEADED","SOLNBR":"SPE5E719T104A","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5315012588581 PIN,SHOULDER,HEADED:\nLine 0001 Qty 112.0  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0194 DAYS ADOApproved sources are 1ZKD0 9230L1100; 75Q65 1536450U.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E719T104A/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332721","OFFADD":"332721","SUBJECT":"53--BOLT,CLOSE TOLERANC","SOLNBR":"SPE5E419T112J","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5306012001176 BOLT,CLOSE TOLERANC:\nLine 0001 Qty 1631.  UI EA  Deliver To: DLA DISTRIBUTION DEPOT OKLAHOMA By: 0018 DAYS ADOApproved sources are 2T498 J816P019A; 58828 J816P019A.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E419T112J/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332510","OFFADD":"332510","SUBJECT":"53--BRACKET,MOUNTING","SOLNBR":"SPE5E719U0015","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5340016593376 BRACKET,MOUNTING:\nLine 0001 Qty 10.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0153 DAYS ADOApproved source is 4WZ02 24111M0203-03.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E719U0015/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332722","OFFADD":"332722","SUBJECT":"53--BOLT,MACHINE","SOLNBR":"SPE5E419T111V","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5306015357093 BOLT,MACHINE:\nLine 0001 Qty 112.0  UI EA  Deliver To: DLA DISTRIBUTION JACKSONVILLE By: 0070 DAYS ADOApproved source is 76005 LM204-189.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E419T111V/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332510","OFFADD":"332510","SUBJECT":"53--BRACKET,MOUNTING","SOLNBR":"SPE5E719T104D","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5340014781886 BRACKET,MOUNTING:\nLine 0001 Qty 78.00  UI EA  Deliver To: DLA DISTRIBUTION SAN DIEGO By: 0274 DAYS ADOApproved sources are 35962 74A430686-2001; 76301 74A430686-2001.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E719T104D/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","ZIP":"19111-5096","CLASSCOD":"53","NAICS":"332722","OFFADD":"332722","SUBJECT":"53--BOLT,CLOSE TOLERANC","SOLNBR":"SPE5E419T111W","RESPDATE":"071519","ARCHDATE":"08142019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5306014440592 BOLT,CLOSE TOLERANC:\nLine 0001 Qty 207.0  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0116 DAYS ADOApproved sources are 06725 HS4243V10-103; 16258 HS4243V10-103; 56878 HS4243V10-103; 57928 HS4243V10-103.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-I-BSM/SPE5E419T111W/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"17","NAICS":"336413","OFFADD":"336413","SUBJECT":"17--TOWBAR,AIRCRAFT","SOLNBR":"SPE8EF19T1773","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1730015624023 TOWBAR,AIRCRAFT:\nLine 0001 Qty 20.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0106 DAYS ADOApproved source is 56833 HT-47S.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8EF19T1773/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"17","NAICS":"336413","OFFADD":"336413","SUBJECT":"17--ADAPTER ASSEMBLY","SOLNBR":"SPE8EF19T1779","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1730011213616 ADAPTER ASSEMBLY:\nLine 0001 Qty 77.00  UI EA  Deliver To: DLA DISTRIBUTION RED RIVER By: 0139 DAYS ADOApproved sources are 01413 104568-503; 28510 104568-2; 81755 C1223-2.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8EF19T1779/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"39","NAICS":"333923","OFFADD":"333923","SUBJECT":"39--TIE DOWN,CARGO,VEHI","SOLNBR":"SPE8EF19T1774","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 3990015553074 TIE DOWN,CARGO,VEHI:\nLine 0001 Qty 536.0  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0166 DAYS ADOApproved sources are 06383 NCMLTF646EH-LP6; 75Q65 10KP580.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8EF19T1774/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"17","NAICS":"336413","OFFADD":"336413","SUBJECT":"17--TRUCK,HELICOPTER GR","SOLNBR":"SPE8EF19T1782","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1730008774959 TRUCK,HELICOPTER GR:\nLine 0001 Qty 18.00  UI EA  Deliver To: THE 2ND SUPPLY DEPOT By: 0005 DAYS ADOApproved source is 00994 8159-010.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8EF19T1782/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"54","NAICS":"332313","OFFADD":"332313","SUBJECT":"54--BERM LINER AND CHES","SOLNBR":"SPE8ED19T1518","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 5430015472539 BERM LINER AND CHES:\nLine 0001 Qty 1.000  UI EA  Deliver To: COMMANDING OFFICER By: 0020 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: COMMANDING OFFICER By: 0020 DAYS ADOApproved source is 4MS69 B-70110-BLC.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8ED19T1518/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"93","NAICS":"326113","OFFADD":"326113","SUBJECT":"93--PLASTIC SHEET","SOLNBR":"SPE8E619T2173","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 9330014630994 PLASTIC SHEET:\nLine 0001 Qty 3.000  UI SH  Deliver To: DLA DISTRIBUTION DEPOT OKLAHOMA By: 0037 DAYS ADOApproved source is 43999 L3223886-025.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E619T2173/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"95","NAICS":"331491","OFFADD":"331491","SUBJECT":"95--PLATE,METAL","SOLNBR":"SPE8EG19T2868","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 9535010134078 PLATE,METAL:\nLine 0001 Qty 1.000  UI PM  Deliver To: SRF AND JRMC YOKOSUKA By: 0005 DAYS ADOLine 0002 Qty 1.000  UI PM  Deliver To: SRF AND JRMC YOKOSUKA By: 0005 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8EG19T2868/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"95","NAICS":"331491","OFFADD":"331491","SUBJECT":"95--SHEET,METAL","SOLNBR":"SPE8EG19T2863","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 9535005037099 SHEET,METAL:\nLine 0001 Qty 27.00  UI SH  Deliver To: DLA DISTRIBUTION WARNER ROBINS By: 0023 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available.  Digitized drawings and Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8EG19T2863/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"62","NAICS":"335129","OFFADD":"335129","SUBJECT":"62--LAMP,LED HEAD","SOLNBR":"SPE8E719T3798","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 6230015379089 LAMP,LED HEAD:\nLine 0001 Qty 3536.  UI EA  Deliver To: DLA DISTRIBUTION RICHMOND By: 0147 DAYS ADOApproved source is 9X319 QUAD-BK-USA.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E719T3798/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"41","NAICS":"333414","OFFADD":"333414","SUBJECT":"41--FAN,CIRCULATING","SOLNBR":"SPE8E719T3799","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4140015598189 FAN,CIRCULATING:\nLine 0001 Qty 5.000  UI EA  Deliver To: DLA DISTRIBUTION WARNER ROBINS By: 0166 DAYS ADOApproved source is 62228 47820-2.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E719T3799/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"45","NAICS":"332913","OFFADD":"332913","SUBJECT":"45--STRAINER,WASTE DRAI","SOLNBR":"SPE8E819T4143","RESPDATE":"080819","ARCHDATE":"09072019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4510016493042 STRAINER,WASTE DRAI:\nLine 0001 Qty 379.0  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0143 DAYS ADOThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E819T4143/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"45","NAICS":"335911","OFFADD":"335911","SUBJECT":"45--SHC BATTERY PACK","SOLNBR":"SPE8E819T4137","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4520014932796 SHC BATTERY PACK:\nLine 0001 Qty 81.00  UI EA  Deliver To: DLA DISTRIBUTION RICHMOND By: 0206 DAYS ADOApproved source is 92878 5-13-5469.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E819T4137/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"42","NAICS":"332919","OFFADD":"332919","SUBJECT":"42--NOZZLE,FIRE EQUIPME","SOLNBR":"SPE8E619T2176","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4210004651904 NOZZLE,FIRE EQUIPME:\nLine 0001 Qty 138.0  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0300 DAYS ADOLine 0002 Qty 1.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0060 DAYS ADOAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E619T2176/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"41","NAICS":"333413","OFFADD":"333413","SUBJECT":"41--FAN,VANEAXIAL","SOLNBR":"SPE8E919T3176","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4140005548214 FAN,VANEAXIAL:\nLine 0001 Qty 1.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0167 DAYS ADOThis is a qualified products list (QPL) item. The solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Military Specifications and Standards may be retrieved, or ordered, electronically.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E919T3176/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"44","NAICS":"332410","OFFADD":"332410","SUBJECT":"44--CORE ASSEMBLY,FLUID","SOLNBR":"SPE8E819T4155","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4420015068627 CORE ASSEMBLY,FLUID:\nLine 0001 Qty 16.00  UI EA  Deliver To: DLA DISTRIBUTION DEPOT HILL By: 0090 DAYS ADOApproved source is 3FZJ9 2112-3011.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E819T4155/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"42","NAICS":"334510","OFFADD":"334510","SUBJECT":"42--DRY SUIT,RESCUE","SOLNBR":"SPE8E619T2204","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4220014993354 DRY SUIT,RESCUE:\nLine 0001 Qty 27.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0187 DAYS ADOApproved sources are 1LV23 MSD-565-L; 54611 183004 (LARGE).\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E619T2204/listing.html","DESC2":"Link To Document","SETASIDE":"Service-Disabled Veteran-Owned Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"17","NAICS":"336413","OFFADD":"336413","SUBJECT":"17--COVER,AIRCRAFT GROU","SOLNBR":"SPE8EF19T1793","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 1730015483829 COVER,AIRCRAFT GROU:\nLine 0001 Qty 29.00  UI EA  Deliver To: DLA DISTRIBUTION BARSTOW By: 0090 DAYS ADOApproved source is 0UHH0 AH800DD.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8EF19T1793/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"76","NAICS":"339999","OFFADD":"339999","SUBJECT":"76--DECAL SET","SOLNBR":"SPE8E619T2195","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 7690014457439 DECAL SET:\nLine 0001 Qty 667.0  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0136 DAYS ADOLine 0002 Qty 1055.  UI EA  Deliver To: W1A8 DLA DIST SAN JOAQUIN By: 0136 DAYS ADOApproved source is U1604 MBEU149663.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E619T2195/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"93","NAICS":"333924","OFFADD":"333924","SUBJECT":"93--WINDOW,OBSERVATION","SOLNBR":"SPE8E619T2197","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 9340015620780 WINDOW,OBSERVATION:\nLine 0001 Qty 59.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0167 DAYS ADOApproved source is 8F963 L31-22300.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E619T2197/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"44","NAICS":"332410","OFFADD":"332410","SUBJECT":"44--COOLER,FLUID,INDUST","SOLNBR":"SPE8E919T3188","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4420015961257 COOLER,FLUID,INDUST:\nLine 0001 Qty 7.000  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0081 DAYS ADOApproved sources are 1XSR7 92072303; 1XSR7 B-28784-ME.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E919T3188/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","ZIP":"19111-5096","CLASSCOD":"41","NAICS":"333413","OFFADD":"333413","SUBJECT":"41--EXHAUST DISPOSAL KI","SOLNBR":"SPE8E719T3821","RESPDATE":"071819","ARCHDATE":"08172019","CONTACT":"Questions regarding this solicitation should be emailed to the buyer listed in block 5 of the solicitation document which can be found under the Additional Information link.\nIf the Additional Information link does not work, please go to https://www.dibbs.bsm.dla.mil/Solicitations/ and type the solicitation number in the Global Search box.","DESC":"Proposed procurement for NSN 4140014942462 EXHAUST DISPOSAL KI:\nLine 0001 Qty 12.00  UI EA  Deliver To: W1A8 DLA DISTRIBUTION By: 0170 DAYS ADOApproved source is 57487 1313-02.\nThe solicitation is an RFQ and will be available at the link provided in this notice.  Hard copies of this solicitation are not available. Specifications, plans, or drawings are not available.\nAll responsible sources may submit a quote which, if timely received, shall be considered.\nQuotes must be submitted electronically.","LINK":"","URL":"https://www.fbo.gov/spg/DLA/J3/DSCP-M-BSM/SPE8E719T3821/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Agriculture","OFFICE":"Farm Production and Conservation Business Center","LOCATION":"Acquisition Division - Operations Branch","ZIP":"20250","CLASSCOD":"F","NAICS":"237990","OFFADD":"","SUBJECT":"WRP - Restoration Improvements","SOLNBR":"12FPC119Q0029","RESPDATE":"073119","CONTACT":"Philip D Reimnitz, Contract Specialist, Phone 402-896-0121 Ext 3502, Fax 855-869-2817, Email philip.reimnitz@usda.gov","DESC":"<p>USDA, Natural Resources Conservation Service in Kentucky is planning to restore a wetland location in Graves and McCraken Counties, Kentucky. Major items of work are as follows: Mobilization and Demobilization, Clearing, Seeding and Mulching, Diversion, Falconite GSS: Rock Chute and Stream Crossing. The duration of the contract is 5 calendar days from the Notice to Proceed. Any contract resulting from this solicitation will be a firm fixed price contract.</p>\r\n<p>The North American Industry Classification (NAICS) for this acquisition is 237990 and the size standard is $36.5 million.</p>\r\n<p>This solicitation is issued as a total Small Business Set-Aside. The magnitude of proposed WRP Site Restoration is between $10,000 and $12,000.</p>\r\n<p>Quotes are due by 1:00 PM, July 31, 2019. Quotes shall be emailed to the Contracting Officer at philip.reimnitz@usda.gov. Please include the solicitation number in the subject line.</p>\r\n<p>A Notice to Proceed is expected to be issued on or about August 1, 2019 with work to begin within 10 days of issuance.<br />The Davis-Bacon Act Wage Determination No. KY47-0000 May, 2019 applies.</p>\r\n<p>Notification of any changes to this solicitation (amendments) shall be made only to the internet. It is therefore the contractor's responsibility to check FBO daily for any posted changes to this solicitation.</p>\r\n<p>E-mail all questions to the Contracting Officer, Phil Reimnitz, at philip.reimnitz@usda.gov. All contractors must register with the System for Award Management (SAM) at www.sam.gov. Failure to register will cause a rejection of your offer.</p>\r\n<p>&nbsp;</p>","LINK":"","URL":"https://www.fbo.gov/notices/6682f74f73fa09721fb94f08a6d64214","DESC2":"Link To Document","SETASIDE":"N/A","POPCOUNTRY":"US","POPZIP":"42066","POPADDRESS":"USDA-Easement \r\nGraves and McCraken Counties, Kentucky\nMayfield, KY"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Agriculture","OFFICE":"Farm Production and Conservation Business Center","LOCATION":"Acquisition Division - Operations Branch","ZIP":"20250","CLASSCOD":"F","NAICS":"237990","OFFADD":"","SUBJECT":"KEACH DIVERSION EDGE OF FIELD  WRP","SOLNBR":"12FPC119C0030","RESPDATE":"073119","CONTACT":"Philip D Reimnitz, Contract Specialist, Phone 402-896-0121 Ext 3502, Fax 855-869-2817, Email philip.reimnitz@usda.gov","DESC":"USDA, Natural Resources Conservation Service in Kentucky is accepting bids for edge of Field (EoF) restoration improvements at the KEACH WRP Property in Henderson County, Kentucky. the contract is 1 eight-hour calendar day from Notice to Proceed. Any contract resulting from this solicitation will be a firm fixed price contract.\r\n<p>The North American Industry Classification (NAICS) for this acquisition is 237990 and the size standard is $36.5 million.</p>\r\n<p>This solicitation is issued as a total Small Business Set-Aside. This effort of proposed construction is between $2,000 and $2,700.</p>\r\n<p>Quotes are due by 1:00 PM EST, July 31, 2019. Quotes shall be emailed to the Contracting Officer at philip.reimnitz@usda.gov. Please include the RFQ number in the subject line.</p>\r\n<p>A Notice to Proceed is expected to be issued on or about aUGUST 5, 2019 with restoration effort to begin within 10 days of issuance.</p>\r\n<p>Notification of any changes to this<br />solicitation (amendments) shall be made only BY FBO.</p>\r\n<p>E-mail all questions to the Contracting Officer, Phil Reimnitz, at philip.reimnitz@usda.gov. All contractors must register with the System for Award Management (SAM) at www.sam.gov. Failure to register will cause a rejection of your offer.</p>","LINK":"","URL":"https://www.fbo.gov/notices/0e25d2851086eb65680b1a1ff02d5889","DESC2":"Link To Document","SETASIDE":"N/A","POPCOUNTRY":"US","POPZIP":"42066","POPADDRESS":"USDA-NRCS\nMAYFIELD, KY"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","ZIP":"22030","CLASSCOD":"65","OFFADD":"1000 Halsey Ave, Marietta, GA 30060","SUBJECT":"65--Audiometric Booth","SOLNBR":"RFQPR11362245","RESPDATE":"071619","ARCHDATE":"01122020","CONTACT":"Name: Client Services, Title: Client Services, Phone: 1.877.933.3243, Fax: 703.422.7822, Email: Clientservices@fedbid.com;","DESC":"This is a combined synopsis/solicitation for commercial items prepared in accordance with the format in FAR Subpart 12.6, as supplemented with additional information included in this notice. The solicitation number is RFQPR11362245 and is issued as a Request for Quote (RFQ), unless otherwise indicated herein. The solicitation document and incorporated provisions and clauses are those in effect through Federal Acquisition Circular 2019-03. The associated North American Industrial Classification System (NAICS) code for this procurement is  334510 with a small business size standard of 1,250.00 employees. This requirement is a [ Small Business ] set-aside and only qualified offerors may submit bids.  The solicitation pricing on www.UnisonMarketplace.com will start on the date this solicitation is posted and will end on 2019-07-16 11:00:00.0 Eastern Time or as otherwise displayed at www.UnisonMarketplace.com. FOB Destination shall be Savannah, GA 31409<BR><BR>The National Guard - Georgia requires the following items, Meet or Exceed, to the following:  <BR><span class=\"label\">LI 001: </span>Mini Audiometric Booth OD 40\" x 32\" x 75\", 1, EA;<BR><span class=\"label\">LI 002: </span>Sound Room Installation, 1, EA;<BR><BR><a href=\"https://marketplace.unisonglobal.com/fbweb/fbobuyDetails.do?token=%3D%3DwBKxmaVGYR9KDW%2BVyNAIu7QAAAAAHeAAgAgTFCGg%2FFzzqQbJAAyVXBA0Or\">Solicitation and Buy Attachments</a><BR><BR>***Question Submission: Interested Offerers must submit any questions concerning the solicitation at the earliest time possible to enable the Buyer to respond. Questions must be submitted by using the 'Submit a Question' feature at www.UnisonMarketplace.com. Questions not received within a reasonable time prior to close of the solicitation may not be considered.***<BR><BR>For this solicitation, National Guard - Georgia intends to conduct an online competitive reverse auction to be facilitated by the third-party reverse auction provider, Unison, Inc. Unison Marketplace has developed an online, anonymous, browser based application to conduct the reverse auction. An Offeror may submit a series of pricing bids, which descend in price during the specified period of time for the aforementioned reverse auction. National Guard - Georgia is taking this action in an effort to improve both vendor access and awareness of requests and the agency's ability to gather multiple, competed, real-time bids. All responsible Offerers that respond to this solicitation MUST submit the pricing portion of their bid using the online exchange located at www.UnisonMarketplace.com. There is no cost to register, review procurement data or make a bid on www.UnisonMarketplace.com. Offerers that are not currently registered to use www.UnisonMarketplace.com should proceed to www.UnisonMarketplace.com to complete their free registration. Offerers that require special considerations or assistance may contact Marketplace Support at 1.877.933.3243 or via email at marketplacesupport@unisonglobal.com. Offerers may not artificially manipulate the price of a transaction on www.UnisonMarketplace.com by any means. It is unacceptable to place bad faith bids, to use decoys in the www.UnisonMarketplace.com process or to collude with the intent or effect of hampering the competitive www.UnisonMarketplace.com process. Should Offerers require additional clarification, notify the point of contact or Marketplace Support at 1.877.933.3243 or marketplacesupport@unisonglobal.com.Use of Unison Marketplace:   Buyers and Sellers agree to conduct this transaction through Unison Marketplace in compliance with the Unison Marketplace Terms of Use. Failure to comply with the below terms and conditions may result in offer being determined as non-responsive.<BR>New Equipment ONLY; NO remanufactured or \"gray market\" items.  All items must be covered by the manufacturer's warranty.<BR><BR>Bid MUST be good for 30 calendar days after close of Buy.<BR><BR>Shipping must be free on board (FOB) destination CONUS (Continental U.S.), which means that the seller must deliver the goods on its conveyance at the destination specified by the buyer, and the seller is responsible for the cost of shipping and risk of loss prior to actual delivery at the specified destination.<BR><BR>This solicitation requires registration with the System for Award Management (SAM) in order to be considered for award, pursuant to applicable regulations and guidelines. Registration information can be found at www.sam.gov. Registration must be \"ACTIVE\" at the time of award.<BR><BR>The selected Offeror must comply with the following commercial item terms and conditions, which are incorporated herein by reference: FAR 52.212-1, Instructions to Offerors - Commercial Items, applies to this acquisition; FAR 52.212-3, Offeror Representations and Certifications - Commercial Items - the selected offeror must submit a completed copy of the listed representations and certifications; FAR 52.212-4, Contract Terms and Conditions - Commercial Items; FAR 52.212-5, Contract Terms and Conditions Required To Implement Statutes or Executive Orders-Commercial Items, paragraph (a) and the following clauses in paragraph (b): 52.222-21, 52.222-26, 52.222-35, 52.222-36, 52.222-37, 52.225-13, 52.232-34. The full text of the referenced FAR clauses may be accessed electronically at https://www.acquisition.gov/far/.<BR><BR>FAR 52.204-16 Commercial and Government Entity Code Reporting, FAR 52.211-6 Brand\r\nName or Equal, DFARS 252.203-7005 Representation Relating to Compensation of Former\r\nDoD Officials, DFARS 252.204-7008 Compliance with Safeguarding Covered Defense\r\nInformation Controls, DFARS 252.204-7011 Alternative Line Item Structure, DFARS\r\n252.213-7000 Notice to Prospective Suppliers on the Use of Past Performance Information\r\nRetrieval System-Statistical Reporting in Past Performance Evaluations<BR><BR>FAR 52.204-16 Commercial and Government Entity Code Reporting, FAR 52.211-6 Brand\r\nName or Equal, DFARS 252.203-7996 (DEV) Prohibition on Contracting with Entities that\r\nRequire Certain Internal Confidentiality Agreements Representation (DEVIATION), DFARS\r\n252.203-7997 Prohibition on Contracting with Entities that Require Certain Internal\r\nConfidentiality Agreements (DEVIATION), DFARS 252.204-7011 Alternative Line Item\r\nStructure, DFARS 252.213-7000 Notice to Prospective Suppliers on the Use of Past\r\nPerformance Information Retrieval System--Statistical Reporting in Past Performance\r\nEvaluations, DFARS 252.225-7000 Buy American Balance of Payments Program Certificate,\r\nDFARS 252.225-7001 Buy American and Balance of Payments Program, DFARS\r\n252.225-7048 Export-Controlled Items, DFARS 252.232-7003 Electronic Submission of\r\nPayment Requests and Receiving Reports<BR><BR>Award will be made to the responsible Seller who is technically acceptable and has the\r\nlowest evaluated price. To receive an acceptable rating, the Seller shall offer a product that\r\nconforms to the salient characteristics attached to this solicitation.<BR><BR>Attachment must not be cut and paste or copied from buyers attached document. It must\r\nbe the sellers bid and detail relating to the solicitation characteristics. Sellers who do not\r\ninclude their own attachment will not be evaluated.<BR><BR>","LINK":"","URL":"https://www.fbo.gov/notices/e18e3de072fbf1baf81c7d4886043c0e","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"31409-4910","POPADDRESS":"Savannah, GA 31409"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Houston VAMC","LOCATION":"Department of Veterans Affairs Medical Center","ZIP":"77030 4298","CLASSCOD":"65","NAICS":"325412","OFFADD":"Department of Veterans Affairs;Network Contracting Office 16;Michael E. DeBakey VA Medical Center;2002 Holcombe BLVD;Houston TX  77030 4298","SUBJECT":"65--580-20-1-026-0021 Siemens HCV Genotyping Testing Supplies (VA-19-00066742)","SOLNBR":"36C25620Q0007","RESPDATE":"071819","ARCHDATE":"07282019","CONTACT":"Oney Kelly\nOney.kelly@va.gov\n\n<a href=\"mailto:Oney.Kelly@va.gov\">Oney.Kelly@va.gov</a>","DESC":"SEE BELOW","LINK":"","URL":"https://www.fbo.gov/spg/VA/HoVAMC/VAMCCO80220/36C25620Q0007/listing.html","DESC2":"Link To Document","EMAIL":"","EMAIL2":"Oney.Kelly@va.gov","DESC3":"Oney.Kelly@va.gov","SETASIDE":"N/A","POPCOUNTRY":"USA","POPZIP":"77030","POPADDRESS":"2002 Holcombe Blvd;Houston TX"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"National Guard Bureau","LOCATION":"USPFO for Utah","ZIP":"84020-2000","CLASSCOD":"54","NAICS":"624221","OFFADD":"PO Box 2000 Draper UT 84020-2000","SUBJECT":"ASAP Emergency Tent with HVAC","SOLNBR":"W911YP19P0033","RESPDATE":"072219","ARCHDATE":"08302019","CONTACT":"Dallas Ray Workman, Contract Specialist, Phone 8014324607, Email dallas.r.workman.civ@mail.mil - Otha B Henderson, Contract Specialist, Phone 8014324093, Email otha.b.henderson.mil@mail.mil","DESC":"Description(s):\r\n<p>DESCRIPTION: The Utah National Guard Joint Operations Center requires the purchase of a shelter system and components to support Joint Staff and support personnel during a natural disaster and prolonged operations in a degraded environment, DLX Enterprises emergency tent with HVAC system is the brand name or equal tent we desire to receive bids on at this time. DLX is the owner of patents, trademarks, and copyright material of the ASAP&reg; Rapid Shelter which is the shelter we or equal we are seeking to procure. We are only seeking procure bids on the tent and the HVAC at this time no other components are needed at this time. Your response to this synopsis solicitation should be based on your ability to provide us with DLX brand or equal.</p>\r\n<p>A LETTER OF JUSTIFICATION is included as an attachment in this solicitation. You must be able to meet or exceed all of the items and requirements addressed in the letter of justification to be able to be considered a responsive vendor to this requirement. This is a combined synopsis/solicitation for commercial services, prepared in accordance with the format in Federal Acquisition Regulation (FAR) Subpart 12.6, as supplemented with additional information included in this notice. This announcement constitutes the only solicitation; quotes are being requested and a written solicitation will not be issued on any other government point of entry. Solicitation W911YP19P0033 is being issued as a Request for Quotation (RFQ). This solicitation incorporates provisions and clauses for commercial items, in effect through Federal Acquisition Circular 2001-12. A single contract will be awarded for this requirement and is subject to availability of funds, this solicitations is not an absolute offer to purchase the items being solicited. This solicitation is issued as a restricted TOTAL SMALL BUSINESS SET-A-SIDE procurement in accordance with FAR Part 19.502(b)(1), before setting aside an acquisition under this paragraph when it is reasonable to expect that offers will be obtained from at least two responsible small business concerns offering this product or service. The North American Industry Classifications System Code (NAICS) for this solicitation is 624221 Temporary shelters. Please respond with your quote to Mr. D. Ray Workman at dallas.r.workman.civ@mail.mil by 07/22/2019 at 11:00 PM MST. Please include with your quote your DUNS no. CAGE CODE, and TAX ID no. (TIN) failure to do so my render your quote none responsive. If you have any questions about this solicitation please email your questions to Mr. Workman as well.</p>\r\n<p>It is requested that all the items listed in the Letter of Brand Name Justification be met by any vendors that desire to respond to this solicitation. If there are any additional questions about this requirement please send them to Mr. Ray Workman.</p>\r\n<p>EVALUATION FACTORS: The contract type for this procurement will be a firm-fixed price and award will be made on the basis on Lowest Price Technically Acceptable (LPTA), In Accordance With (IAW) FAR 15.101-2 Where the lowest price technically acceptable source selection process is appropriate when best value is expected to result from selection of the technically acceptable proposal with the lowest evaluated price. The contractor will be required to meet all of the requirements in the SOW to be considered responsive to this solicitation. Price and ability to meet the technical aspects outlined in the SOW will be considered when evaluating the quotes. The Government reserves the right to award to other than the low quote if the lowest quote does not meet the technical requirements of this solicitation.</p>\r\n<p>QUOTES: Quotes are due no later than (NLT) 11:00 PM MST 22 July, 2019. Quotes will be Emailed to: dallas.r.workman.civ@mail.mil. Facsimiles will NOT be accepted.</p>\r\n<p>APPLICABLE PROVISIONS AND CLAUSES: The following clauses and provisions are incorporated by reference.&nbsp; FAR clauses and provisions can be read in their full text at www.acqnet.gov/far and DFARS clauses and provisions can be read in their full text at www.acq.osd.mil/dpap/dars/dfars. The clauses are to remain in full force in any resultant contract.</p>\r\n<p>FAR 52.203-3 - Gratuities<br />FAR 52.203-6 ALT I - Restrictions on Subcontractor Sales to the Government<br />FAR 52.204-2 ALT II - Security Requirements<br />FAR 52.204-4 - Printed or Copied - Double Sided on Post-Consumer Fiber Content paper<br />FAR 52.204-7 - Central Contractor Registration<br />FAR 52.204-9 - Personal Identity Verification of Contractor Personnel<br />FAR 52.204-10 - Reporting Executive Compensation and First-Tier Subcontract Awards<br />FAR 52.209-6 - Protecting the Government's Interest When Subcontracting with Contractors Debarred, Suspended, or Proposed for Debarment<br />FAR 52.212-1 - Instructions to Offerors--Commercial Items<br />FAR 52.212-2 - Evaluation --Commercial Items<br />FAR 52.212-3 - Offeror Representations and Certifications-Commercial Items, with Alternate I<br />FAR 52.212-4 - Contract Terms and Conditions--Commercial Items<br />FAR 52.212-5 - Contract Terms and Conditions Required to Implement Statutes or Executive Orders Commercial Items.<br />FAR 52.219-8 - Utilization of Small Business Concerns<br />FAR 52.219-14 - Limitation on Subcontracting<br />FAR 52.219-28 - Post Award Small Business Program Representation<br />FAR 52.222-3 - Convict Labor<br />FAR 52.222-19 - Child Labor Cooperation with Authorities and Remedies<br />FAR 52.222-21 - Prohibition of Segregated Facilities<br />FAR 52.222-26 - Equal Opportunity<br />FAR 52.222-35 - Equal Opportunity for Veterans<br />FAR 52.222-36 - Affirmative Action for Workers with Disabilities<br />FAR 52.222-37 - Employment Reports on Veterans<br />FAR 52.222-40 - Notification of Employee Rights Under the National Labor Relations Act<br />FAR 52.222-41 - Service Contract Act<br />FAR 52.222-42 - Statement of Equivalent Rates for Federal Hires<br />FAR 52.222-44 - Fair Labor Standards Act and Service Contract Act - Price Adjustment<br />FAR 52.222-50 - Combating Trafficking in Persons<br />FAR 52.222-54 - Employment Eligibility Verification<br />FAR 52.223-18 - Encouraging Contractor Policy to Ban Text Messaging while Driving<br />FAR 52.225-13 - Restrictions on Certain Foreign Purchases<br />FAR 52.232-33 - Payment by Electric Funds Transfer-Central Contractor Registration<br />FAR 52.233-3 - Protest After Award<br />FAR 52.233-4 - Applicable Law for Breach of Contract Claim<br />FAR 52.223-3 - Hazardous Material Identification and Material Safety Data<br />FAR 52.223-5 - Pollution Prevention and Right-to-know Information<br />FAR 52.228-5 - Insurance - Work on a Government Installation<br />FAR 52.233-2 - Service of Protest<br />FAR 52.237-2 - Protection of Government Buildings, Equipment and Vegetation<br />FAR 52.252-2 - Clauses Incorporated by Reference<br />DFARS 252.201-7000 - Contracting Officer's Representative<br />DFARS 252.203-7000 - Requirements Relating to Compensation of Former DoD Officials<br />DFARS 252.204-7004 - Central Contractor Registration, Alternate A<br />DFARS 252.204-7005 - Oral Attestation of Security Responsibilities<br />DFARS 252.209-7001 - Disclosure of Ownership or Control by a Government of a Terrorist Country<br />DFARS 252.212-7000 - Offeror Representations and Certifications - Commercial Items</p>","LINK":"","URL":"https://www.fbo.gov/spg/USA/NGB/DAHA42/W911YP19P0033/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"84020","POPADDRESS":"Utah National Guard Headquarters, 12953 So. Minuteman Dr.\nDraper, UT"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Commerce","OFFICE":"National Institute of Standards and Technology (NIST)","LOCATION":"Acquisition Management Division","ZIP":"20899-1410","CLASSCOD":"P","NAICS":"562112","OFFADD":"100 Bureau Drive, Building 301\r\nRoom B130 Gaithersburg MD 20899-1410","SUBJECT":"Transforer Disposal Services","SOLNBR":"NB195000-19-00741","RESPDATE":"060619","CONTACT":"Gina Lee, Contract Specialist, Phone 3019758334, Email gina.lee@nist.gov","DESC":"The resulting contract will be an IDIQ contract with one Base and three Option Years.<br /><br />Government is seeking a Contractor to provide services for the transportation and disposal of Non-PCB, PCB and PCB-contaminated transformers, located at NIST facility in Gaithersburg, Maryland.\r\n<p>Contractor shall furnish all labor, materials and equipment for the following:<br />&bull; Handling, labeling and packaging required for transporting PCB waste.<br />&bull; Loading and securing the wastes for transport.<br />&bull; Transporting and properly disposing of non-PCB, PCB and PCB-contaminated transformer carcasses and containers per EPA regulation, 40 CFR Part 761 and COMAR 26.13 - Incineration. <br />&bull; Transporting and disposing of the transformer dielectric fluid and transformer waste per EPA regulation, 40 CFR Part 761.<br />&bull; Provide the Contracting Officer Representative (COR) with all completed manifests and Certificate of Destruction and Disposal.<br />&bull; Provide current fluid analysis showing PCB content of transformer(s) in PPM (parts per million). <br />&bull; Provide chlorinated hydrocarbons/tetrachloroethylene analysis content of transformer(s) in PPM.</p>\r\n<p>&nbsp;</p>","LINK":"","URL":"https://www.fbo.gov/spg/DOC/NIST/AcAsD/NB195000-19-00741/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"20899","POPADDRESS":"National Institute of Standards and Technology\r\n100 Bureau Drive\r\n\nGaithersburg, MD"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"Non-Appropriated Funds","LOCATION":"US Army Family and MWR Command","ZIP":"22302","CLASSCOD":"53","NAICS":"444130","OFFADD":"4700 King Street Alexandria VA 22302","SUBJECT":"Dell Computer and Monitor","SOLNBR":"NAFIB3-19-Q-0030","RESPDATE":"071519","CONTACT":"Mi Ok Yi, Procurement Technician, Phone 3157552676, Email miok.yi.ln@mail.mil","DESC":"Dell Computer and Monitor","LINK":"","URL":"https://www.fbo.gov/spg/USA/NAF/NAFBA1/NAFIB3-19-Q-0030/listing.html","DESC2":"Link To Document","SETASIDE":"Competitive 8(a)"},{"DATE":"0707","YEAR":"19","AGENCY":"Agency for International Development","OFFICE":"Overseas Missions","LOCATION":"Philippines USAID-Manila","ZIP":"96440","CLASSCOD":"R","NAICS":"541990","OFFADD":"Amer Emb/Manila\nUSAID #8115 APO AP 96440","SUBJECT":"Evidence-Driven Collaborating, Learning and Adapting at USAID/Philippines","SOLNBR":"72049219R00009","RESPDATE":"081219","ARCHDATE":"07072020","CONTACT":"Ma. Belinda  Y De La Torre, Senior Acquisition Specialist, Phone (63)(2) 301-6000, Fax (63)(2) 301-6213, Email mdela@usaid.gov - Irene Narag, Phone (63)(2) 3016000, Email inarag@usaid.gov","DESC":"Issuance Date of RFP\t:\tJuly 7, 2019\r\n<p>Deadline for Receipt of Questions\t:\tJuly 15, 2019, Monday, at 0600H, Philippine Standard Time (PST)</p>\r\n<p>Responses posted to FBO\t:\to/a July 24, 2019</p>\r\n<p>Deadline for Receipt of Proposals\t:\tAugust 12, 2019, Monday, at 0600H (PST)</p>\r\n<p>SUBJECT\t:\tRequest for Proposal (RFP) No. 72049218R00009<br /> Evidence-Driven Collaborating, Learning and Adapting (ED-CLA) at USAID/Philippines</p>\r\n<p>To All Prospective Offerors:</p>\r\n<p>The United States Agency for International Development, through its Mission in the Philippines (USAID/Philippines) seeks proposals from qualified Small Business concerns interested in providing services as described in Section C of the attached solicitation. The applicable geographic code for this procurement is 937. The North American Industry Classification System (NAICS) code is 541990.</p>\r\n<p>As defined under the Small Business Act, FAR 2.101, and FAR 52.219-6, a small business concern means a concern, including its affiliates, which is independently owned and operated, not dominant in its field of operation in which it is bidding on Government contracts, and qualified as a small business under the size standards in this solicitation.</p>\r\n<p>In accordance with FAR 19.301-1(a), \"To be eligible for award as a small business, an offeror must represent in good faith that it is a small business at the time of its written representation. An offeror may represent that it is a small business concern in connection with a specific solicitation if it meets the definition of a small business applicable to the solicitation and has not been determined by the Small Business Administration (SBA) to be other than a small business.</p>\r\n<p>USAID/Philippines anticipates awarding a hybrid cost-plus-fixed fee (CPFF) completion and IDIQ contract as a result of this solicitation, covering an estimated period of a base of three years for both the cost-plus-fixed-fee and the IDIQ portions, with two one-year options, subject to the availability of funds and satisfactory performance. The cost-plus-fixed-fee completion contract is intended for \"Core\" services while the IDIQ contract is intended for \"On Demand\" services.  The total cost of the entire award (base plus two option years) is estimated at a maximum of $13 million, with the cost of \"Core\" services estimated at a third of the maximum amount. Offerors must propose realistic and reasonable costs for the work described in their proposal. USAID encourages the most efficient and effective approach for achieving the expected results.</p>\r\n<p>This procurement is set aside for Small Business and will be conducted under Federal Acquisition Regulation (FAR) Part 15, Contracting by Negotiations.  USAID reserves the right to award a contract based on best value and without discussion.</p>\r\n<p>Offerors must submit all questions and requests for clarification concerning this solicitation electronically by the due date and time indicated above to manila-roaa-rfp@usaid.gov. If USAID receives substantive questions that affect the solicitation or necessitates changes to the closing date, time, or other aspects of the RFP, USAID will amend this solicitation. The RFP amendments will be issued and posted on Federal Business Opportunities, the Government-wide point of entry (GPE), located at https://www.fbo.gov/ . Offerors are strongly encouraged to check the FBO website periodically as acknowledgement of any such amendments is required to accompany the offeror's proposal.</p>\r\n<p>When submitting questions and requests for clarification regarding this RFP, please state the specific RFP page and section.</p>\r\n<p>It remains the offeror's responsibility to ensure that it has downloaded and received the RFP in its entirety, including subsequent solicitation amendments, if any. USAID/Philippines bears no responsibility for data errors resulting from download, transmission, or conversion processes. Furthermore, offerors are advised to read the solicitation carefully. Block 12 of Standard Form (SF)-33 of this RFP requires that offers remain valid for 180 calendar days from the closing date.</p>\r\n<p>Offerors are also instructed to pay careful attention to RFP Section K - \"Representations, Certifications and Other Statements of Offerors.\" Offerors must comply with FAR 52.204-7, the System for Award Management (SAM), by registering and completing the annual representations and certifications electronically at https://www.sam.gov/portal/public/SAM/. No award may be made to an offeror who is not registered and active in SAM.</p>\r\n<p>USAID is not obligated to award a contract by the issuance of this solicitation. Neither is USAID committed to pay for any costs incurred by offerors in the preparation and submission of a technical proposal or in participation in oral presentation. Award will be subject to funds availability following the proper completion of required USAID internal processes and other internal USAID approvals.</p>\r\n<p>Sincerely,</p>\r\n<p><br /> /S/<br /> Sandra Jansen<br /> Contracting Officer<br /> Regional Office of Acquisition &amp; Assistance</p>\r\n<p>&nbsp;</p>","LINK":"","URL":"https://www.fbo.gov/spg/AID/OM/PHI/72049219R00009/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Technology Acquisition Center","LOCATION":"VA Technology Acquisition Center","ZIP":"07724","CLASSCOD":"D","NAICS":"517311","OFFADD":"Department of Veterans Affairs;Technology Acquisition Center;23 Christopher Way;Eatontown NJ  07724","SUBJECT":"D--55498 - Source Selection - Contract Puerto Rico Data and Voice (LEC)","SOLNBR":"36C10B19R0035","RESPDATE":"071219","ARCHDATE":"09102019","CONTACT":"Amanda.Bleses@va.gov\n\n<a href=\"mailto:Amanda.Bleses@va.gov\">Amanda.Bleses@va.gov</a>","DESC":"Department of Veterans Affairs (VA) Office of Information and Technology (OI&T), and Office of Information Security, District 2, Telephone Business Office requires LEC telecommunication services for VA owned or managed facilities. The Contractor shall install and provide LEC telecommunication data/voice services to VA OI&T District 2 sites located in Puerto Rico, St. Croix and St. Thomas of the U.S. Virgin Islands as listed in the Performance Work Statement (PWS) and based on their Local Access and Transport Area coverage. These sites include VA Medical Centers, Veteran Outreach Centers, Community Based Outpatient Clinics, National Cemeteries, Veteran Benefits Offices and other VA facilities in the Southeast District 2 catchment area. The period of performance for this effort will be August 1, 2019 through July 31, 2020 with four 12-month option periods, if exercised. The North American Industrial Classification (NAICS) for this effort is 517311.  \nThis acquisition will be conducted on the basis of small business set-aside.  The resultant contract will be firm fixed priced. A formal source selection process will be utilized and contract award will be based on the best overall (i.e., best value) proposal that is determined to be the most beneficial to the Government.\nThe Point of Contact for this action is Amanda Bleses, Contract Specialist. \nQuestions/responses shall be submitted to the contract specialist by July 10, 2019 at 10AM ET at Amanda.Bleses@va.gov.","LINK":"","URL":"https://www.fbo.gov/notices/ad844374a7fc96ca839d0a9a6bfc47e9","DESC2":"Link To Document","EMAIL":"","EMAIL2":"Amanda.Bleses@va.gov","DESC3":"Amanda.Bleses@va.gov","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"ACC OO","LOCATION":"411TH CSB (W90VN9) RCO DAEGU","ZIP":"96205-5289","CLASSCOD":"24","NAICS":"333924","OFFADD":"Unit #15289 APO 1 96205-5289","SUBJECT":"7 Electrical Fork Lift","SOLNBR":"W90VN9-19-T-0004","NTYPE":"COMBINE","RESPDATE":"070819","CONTACT":"Pak Pak, Contract Specialist, Phone 3157688098, Email sangku.pak2.ln@mail.mil","DESC":"This posting was uploading using the incorrect Solicitation Number and is reposted as W90VN9-19-T-0005.","LINK":"","URL":"https://www.fbo.gov/notices/e7bba1d38b891eca3920f4a30591f32e","DESC2":"Link To Document","SETASIDE":"N/A","POPCOUNTRY":"KR","POPZIP":"96205-5284","POPADDRESS":"KS, S6 Div, KSC\r\nAPO AP96205-5284\r\nSee Solicitation for various delivery location\r\n\nAPO AP, 1"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"ACC OO","LOCATION":"411TH CSB (W91QVN) PARC OFFICE CAMP HUMPHREYS","ZIP":"96205-0062","CLASSCOD":"58","NAICS":"334220","OFFADD":"","SUBJECT":"Video Distribution","SOLNBR":"W91QVN-19-R-0209","NTYPE":"COMBINE","RESPDATE":"071019","CONTACT":"Yi, Hye Ok, Contract Specialist, Phone 3157553392, Email hyeok.yi.ln@mail.mil","DESC":"<span style=\"font-family: Calibri; font-size: small;\">\r\n<p style=\"margin: 0px;\">&nbsp;</p>\r\n<p style=\"margin: 0px;\">a. The purpose of this amendment is to extend the closing to extend from 5 July 2019 t0 11 July 2019.</p>\r\n<p style=\"margin: 0px;\">&nbsp;</p>\r\n<p style=\"margin: 0px;\">&nbsp;</p>\r\n<p style=\"margin: 0px;\">&nbsp;</p>\r\n<p style=\"margin: 0px;\">b. All other terms and conditions remain unchanged.</p>\r\n<p style=\"margin: 0px;\">&nbsp;</p>\r\n</span>\r\n<p style=\"margin: 0px;\"><span style=\"font-family: Calibri; font-size: small;\"><strong></strong></span></p>","LINK":"","URL":"https://www.fbo.gov/notices/bbbb246071b0027189cc55f14f39b200","DESC2":"Link To Document","SETASIDE":"N/A","POPCOUNTRY":"KR","POPADDRESS":"Korea Wide, 1"},{"DATE":"0707","YEAR":"19","AGENCY":"Other Defense Agencies","OFFICE":"Department of Defense Education Activity","LOCATION":"DoDEA Pacific Procurement Office (DPPO)","ZIP":"96376-5007","CLASSCOD":"R","NAICS":"711219","OFFADD":"Unit 35007 APO AP 96376-5007","SUBJECT":"Sports Officials for Misawa AB, Japan","SOLNBR":"HE125419R4004","NTYPE":"COMBINE","RESPDATE":"071519","CONTACT":"Duke Santos, Contract Specialist, Phone 011810425522510 ext.53439, Email duke.santos@dodea.edu - John Baggett, Contract Officer, Phone 81989381111 Ext 6345694, Email john.baggett@dodea.edu","DESC":"","LINK":"","URL":"https://www.fbo.gov/spg/ODA/DoDEA/FPOAP/HE125419R4004/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"JP","POPADDRESS":"ROBERT D EDGREN HIGH SCHOOL\r\nMISAWA AIR BASE, BLDG 746 HIRAHATA\r\nMISAWA-SHI\r\nAOMORI-KEN JAPAN  033-0012"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","ZIP":"22030","CLASSCOD":"25","OFFADD":"1000 Halsey Ave, Marietta, GA 30060","SUBJECT":"25--HEMTTS Containment System","SOLNBR":"RFQPR11193788","NTYPE":"COMBINE","RESPDATE":"071619","ARCHDATE":"01122020","CONTACT":"Name: Client Services, Title: Client Services, Phone: 1.877.933.3243, Fax: 703.422.7822, Email: Clientservices@fedbid.com;","DESC":"AMENDMENT NOTICE: This is a combined synopsis/solicitation for commercial items prepared in accordance with the format in FAR Subpart 12.6, as supplemented with additional information included in this notice. The solicitation number is RFQPR11193788 and is issued as a Request for Quote (RFQ), unless otherwise indicated herein. The solicitation document and incorporated provisions and clauses are those in effect through Federal Acquisition Circular 2019-03. The associated North American Industrial Classification System (NAICS) code for this procurement is 336999 with a small business size standard of 500.00 employees. This requirement is a [ Small Business ] set-aside and only qualified offerors may submit bids. The solicitation pricing on www.UnisonMarketplace.com will start on the date this solicitation is posted and will end on 2019-07-16 12:00:00.0 Eastern Time or as otherwise displayed at www.UnisonMarketplace.com. FOB Destination shall be Marietta, GA 30060<BR><BR>The National Guard - Georgia requires the following items, Meet or Exceed, to the following:  <BR><span class=\"label\">LI 001: </span>One Piece 40' x 12' x 10\"H Config. - Cap. 2,900g; Base\r\nModel - 90 sidewall, epoxy coating, one \"X\" ramp, 4ea Drain Ports,\r\nFilter Berm, Ball Valve. Line-of-Sight Poles, Lifting Lugs, optional trilinear sidewalls, fiberglass finish,, 2, EA;<BR><span class=\"label\">LI 002: </span>Wide Load Freight, 1, EA;<BR><span class=\"label\">LI 003: </span>A crane rental and crew to off-load and setup systems, 1, EA;<BR><BR><a href=\"https://marketplace.unisonglobal.com/fbweb/fbobuyDetails.do?token=%3D%3DwBKxmaVGYR9S8tOZylx9LWQAAAAAHeAAgAgTFCGg%2FFzzqQbJAAyVXBA0Or\">Solicitation and Buy Attachments</a><BR><BR>***Question Submission: Interested offerors must submit any questions concerning the solicitation at the earliest time possible to enable the Buyer to respond. Questions must be submitted by using the 'Submit a Question' feature at www.UnisonMarketplace.com. Questions not received within a reasonable time prior to close of the solicitation may not be considered.***<BR><BR>For this solicitation, National Guard - Georgia intends to conduct an online competitive reverse auction to be facilitated by the third-party reverse auction provider, Unison, Inc. Unison Marketplace has developed an online, anonymous, browser based application to conduct the reverse auction. An Offeror may submit a series of pricing bids, which descend in price during the specified period of time for the aforementioned reverse auction. National Guard - Georgia is taking this action in an effort to improve both vendor access and awareness of requests and the agency's ability to gather multiple, competed, real-time bids. All responsible Offerors that respond to this solicitation MUST submit the pricing portion of their bid using the online exchange located at www.UnisonMarketplace.com. There is no cost to register, review procurement data or make a bid on www.UnisonMarketplace.com. Offerors that are not currently registered to use www.UnisonMarketplace.com should proceed to www.UnisonMarketplace.com to complete their free registration. Offerors that require special considerations or assistance may contact Marketplace Support at 1.877.933.3243 or via email at marketplacesupport@unisonglobal.com. Offerors may not artificially manipulate the price of a transaction on www.UnisonMarketplace.com by any means. It is unacceptable to place bad faith bids, to use decoys in the www.UnisonMarketplace.com process or to collude with the intent or effect of hampering the competitive www.UnisonMarketplace.com process. Should offerors require additional clarification, notify the point of contact or Marketplace Support at 1.877.933.3243 or marketplacesupport@unisonglobal.com.Use of Unison Marketplace:   Buyers and Sellers agree to conduct this transaction through Unison Marketplace in compliance with the Unison Marketplace Terms of Use. Failure to comply with the below terms and conditions may result in offer being determined as non-responsive.<BR>New Equipment ONLY; NO remanufactured or \"gray market\" items.  All items must be covered by the manufacturer's warranty.<BR><BR>Bid MUST be good for 30 calendar days after close of Buy.<BR><BR>Shipping must be free on board (FOB) destination CONUS (Continental U.S.), which means that the seller must deliver the goods on its conveyance at the destination specified by the buyer, and the seller is responsible for the cost of shipping and risk of loss prior to actual delivery at the specified destination.<BR><BR>This solicitation requires registration with the System for Award Management (SAM) in order to be considered for award, pursuant to applicable regulations and guidelines. Registration information can be found at www.sam.gov. Registration must be \"ACTIVE\" at the time of award.<BR><BR>The selected Offeror must comply with the following commercial item terms and conditions, which are incorporated herein by reference: FAR 52.212-1, Instructions to Offerors - Commercial Items, applies to this acquisition; FAR 52.212-3, Offeror Representations and Certifications - Commercial Items - the selected offeror must submit a completed copy of the listed representations and certifications; FAR 52.212-4, Contract Terms and Conditions - Commercial Items; FAR 52.212-5, Contract Terms and Conditions Required To Implement Statutes or Executive Orders-Commercial Items, paragraph (a) and the following clauses in paragraph (b): 52.222-21, 52.222-26, 52.222-35, 52.222-36, 52.222-37, 52.225-13, 52.232-34. The full text of the referenced FAR clauses may be accessed electronically at https://www.acquisition.gov/far/.<BR><BR>FAR 52.204-16 Commercial and Government Entity Code Reporting, DFARS 252.203-7005 Representation Relating to Compensation of Former\r\nDoD Officials, DFARS 252.204-7008 Compliance with Safeguarding Covered Defense\r\nInformation Controls, DFARS 252.204-7011 Alternative Line Item Structure, DFARS\r\n252.213-7000 Notice to Prospective Suppliers on the Use of Past Performance Information\r\nRetrieval System-Statistical Reporting in Past Performance Evaluations<BR><BR>FAR 52.204-16 Commercial and Government Entity Code Reporting, FAR 52.211-6 Brand\r\nName or Equal, DFARS 252.203-7996 (DEV) Prohibition on Contracting with Entities that\r\nRequire Certain Internal Confidentiality Agreements Representation (DEVIATION), DFARS\r\n252.203-7997 Prohibition on Contracting with Entities that Require Certain Internal\r\nConfidentiality Agreements (DEVIATION), DFARS 252.204-7011 Alternative Line Item\r\nStructure, DFARS 252.213-7000 Notice to Prospective Suppliers on the Use of Past\r\nPerformance Information Retrieval System--Statistical Reporting in Past Performance\r\nEvaluations, DFARS 252.225-7000 Buy American Balance of Payments Program Certificate,\r\nDFARS 252.225-7001 Buy American and Balance of Payments Program, DFARS\r\n252.225-7048 Export-Controlled Items, DFARS 252.232-7003 Electronic Submission of\r\nPayment Requests and Receiving Reports<BR><BR>Award will be made to the responsible Seller who is technically acceptable and has the\r\nlowest evaluated price. To receive an acceptable rating, the Seller shall offer a product that\r\nconforms to the salient characteristics attached to this solicitation.<BR><BR>Attachment must not be cut and paste or copied from buyers attached document. It must\r\nbe the sellers bid and detail relating to the solicitation characteristics. Sellers who do not\r\ninclude their own attachment will not be evaluated.<BR><BR>","LINK":"","URL":"https://www.fbo.gov/notices/5dc35a0e2f87be747aa4a7dcf34303ca","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"30060-4277","POPADDRESS":"Marietta, GA 30060"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","ZIP":"22030","CLASSCOD":"U","OFFADD":"2015 North 4th Street, Joint Base Lewis-McChord, WA 98466","SUBJECT":"U--Special Operations Forces (SOF) Role Players","SOLNBR":"W911S819R0013","NTYPE":"COMBINE","RESPDATE":"071719","ARCHDATE":"01132020","CONTACT":"Name: Client Services, Title: Client Services, Phone: 1.877.933.3243, Fax: 703.422.7822, Email: Clientservices@fedbid.com;","DESC":"AMENDMENT NOTICE: This is a combined synopsis/solicitation for commercial items prepared in accordance with the format in FAR Subpart 12.6, as supplemented with additional information included in this notice. The solicitation number is W911S819R0013 and is issued as a Request for Quote (RFQ), unless otherwise indicated herein. The solicitation document and incorporated provisions and clauses are those in effect through Federal Acquisition Circular 2019-03. The associated North American Industrial Classification System (NAICS) code for this procurement is 541930 with a small business size standard of $7.50M. This requirement is a [ Small Business ] set-aside and only qualified offerors may submit bids. The solicitation pricing on www.UnisonMarketplace.com will start on the date this solicitation is posted and will end on 2019-07-17 17:00:00.0 Eastern Time or as otherwise displayed at www.UnisonMarketplace.com. FOB Destination shall be JBLM, WA 98433<BR><BR>The MICC Joint Base Lewis McChord requires the following items, Meet or Exceed, to the following:  <BR><span class=\"label\">LI 001: </span>Role Players for Platoon Full Mission Profiles (FMPs). The Contractor shall provide role players in support of the stated training objectives and tasks that will satisfy the Commander's intent for training.  Please see attached Performance Work Statement for complete details., 1, EA;<BR><span class=\"label\">LI 002: </span>Contractor Management Reporting. The Officer of the Assistant Secretary of the Army (Manpower & Reserve Affairs) operates and maintains a secure Army data collection site where the contractor will report ALL contractor manpower (including subcontractor manpower) required for performance of this contract. The contractor is required to completely fill in all the information in the format using the following web address https://www.ecmra.mil/Default.aspx. For further assistance, email the ECMRA Help Desk at DoD.ECMRA.Support.Desk@mail.mil., 1, EA;<BR><BR><a href=\"https://marketplace.unisonglobal.com/fbweb/fbobuyDetails.do?token=%3D%3DwBKxmaVGYR9mLtVatjTqgZQAAAAAHeAAgAgTFCGg%2FFzzqQbJAAyVXBA0Or\">Solicitation and Buy Attachments</a><BR><BR>***Question Submission: Interested offerors must submit any questions concerning the solicitation at the earliest time possible to enable the Buyer to respond. Questions must be submitted by using the 'Submit a Question' feature at www.UnisonMarketplace.com. Questions not received within a reasonable time prior to close of the solicitation may not be considered.***<BR><BR>For this solicitation, MICC Joint Base Lewis McChord intends to conduct an online competitive reverse auction to be facilitated by the third-party reverse auction provider, Unison, Inc. Unison Marketplace has developed an online, anonymous, browser based application to conduct the reverse auction. An Offeror may submit a series of pricing bids, which descend in price during the specified period of time for the aforementioned reverse auction. MICC Joint Base Lewis McChord is taking this action in an effort to improve both vendor access and awareness of requests and the agency's ability to gather multiple, competed, real-time bids. All responsible Offerors that respond to this solicitation MUST submit the pricing portion of their bid using the online exchange located at www.UnisonMarketplace.com. There is no cost to register, review procurement data or make a bid on www.UnisonMarketplace.com. Offerors that are not currently registered to use www.UnisonMarketplace.com should proceed to www.UnisonMarketplace.com to complete their free registration. Offerors that require special considerations or assistance may contact Marketplace Support at 1.877.933.3243 or via email at marketplacesupport@unisonglobal.com. Offerors may not artificially manipulate the price of a transaction on www.UnisonMarketplace.com by any means. It is unacceptable to place bad faith bids, to use decoys in the www.UnisonMarketplace.com process or to collude with the intent or effect of hampering the competitive www.UnisonMarketplace.com process. Should offerors require additional clarification, notify the point of contact or Marketplace Support at 1.877.933.3243 or marketplacesupport@unisonglobal.com.Use of Unison Marketplace:   Buyers and Sellers agree to conduct this transaction through Unison Marketplace in compliance with the Unison Marketplace Terms of Use. Failure to comply with the below terms and conditions may result in offer being determined as non-responsive.<BR>The Contracting Officer (KO) at Mission and Installation Contracting Command, Joint Base Lewis-McChord is the only person authorized to approve changes or modify any of the requirements under this solicitation, and notwithstanding anything contained elsewhere in this solicitation, the said authority remains solely with the KO. In the event the Contractor or contractor employee effects any such change at the direction of any person other than the KO, the change will be considered to have been without authority, and no adjustment will be made in the price of any subsequently awarded contract under the Changes clause or any other clause to cover any increase in costs incurred as a result thereof.<BR><BR>In order to enhance the efficiency of the procurement process, the Government intends to evaluate only the lowest priced quote to determine if the quote is technically acceptable and whether the vendor has acceptable or neutral past performance. If the lowest priced quote is reasonably priced and technically acceptable and the vendor has acceptable or neutral past performance, the Government intends to make an award to that vendor and no other quote will be evaluated. If the lowest priced offer is not technically acceptable, the vendor does not have acceptable or neutral past performance, or both, then the Government will evaluate the second lowest priced quote for technical acceptability and acceptable or neutral past performance. This method will continue until the lowest priced, technically acceptable quote, by a vendor with acceptable or neutral past performance, is determined. Quotes will be evaluated based on price and technical acceptability. Quoter/Offeror certifies that the product quoted meets or exceeds all minimum requirements as stated in the Request for Quotes.<BR><BR>The Government will award a contract resulting from this solicitation to the responsible offeror whose offer conforming to the solicitation will be most advantageous to the Government, price and other factors considered. These additional factors are listed within the Performance Work Statement under Requirement Qualifications and the FMP Requirements section.<BR><BR>Quotes MUST be valid for 30 days after Request for Quote/solicitations closing date.<BR><BR>In accordance with FAR 19.102(b), the small business size standard is applied by classifying the product or service being acquired in the industry whose definition, as found NAICS Manual, best describes the principal nature of the product or service being acquired. The NAICS code selected for this acquisition is (000000, DESCRIPTION) with an applicable small business size standard of ($Mil or # Employees).<BR><BR>Contact MarketplaceSupport@unisonglobal.com or call 1-877-933-3243 to address any questions for quotes utilizing Unison Marketplace.<BR><BR>Quotes must be submitted per unit price. Multiple awards will not be made; therefore, quotes that cover less than all the items and quantities in this solicitation will be rejected and deemed non-responsive.<BR><BR>The Vendor must pre-screen applicants using the E-verify Program (http://www.dhs.gov/E-Verify) website to meet the established employment eligibility requirements. The vendor must ensure that the applicant has two valid forms of government issued identification.<BR><BR>All contractor employees, including subcontractor employees, requiring access to an Army or USSOCOM controlled installation, facility, or area shall comply with applicable security policies and procedures (provided by the government representative). This includes policies pertaining to the use or prohibition of electronic recorders, devices, cameras, etc. If the Contractor is required to take photographs or videos on a Government Installation, the Contractor must obtain written permission from the Senior Commander. The contractor shall also provide all information required for background checks to meet installation and facility access requirements to be completed by the installation Provost Marshal Office, Director of Emergency Services, or Security Office. The contractor workforce must comply with all personal identity verification requirements as directed by DoD, HQDA, USSOCOM, USASOC and/or local policy. In addition to the changes otherwise authorized by the changes clause of this contract, should Force Protection Condition (FPCON) at any individual facility or installation change, the government may require changes in contractor security matters or processes.<BR><BR>Per AR 530-1, Operations Security, new contract employees must complete OPSEC Level I training within 30 calendar days of reporting for duty. All contract employees must complete annual OPSEC Awareness Training.<BR><BR>The Vendor shall comply with FAR 52.204-2, Security Requirements for access to information classified \"Confidential\", \"Secret\", or \"Top Secret\". The Vendor must execute a Security agreement (DD Form 441), IAW the National Industrial Security Program Operating Manual (DoD 5220.22-M) and any revisions to DoD 5220.22-M (Note: A DD Form 254 will be required for any contract that requires access to classified information and/or a security clearance.)<BR><BR>The Vendor must obtain a Facility Clearance at the appropriate level (IAW the NISPOM DoD 5220.22-M) prior to the start of the contract awarded period of performance. Contractor personnel performing work under this contract must have the required security clearance at the appropriate level at the start of the period of performance. Security clearances and Facility Clearance (FCL) requirements are required to be maintained for the life of the contract in accordance with the DD254 attached to the contract. Upon identification of Lowest Priced Technically Acceptable Vendor, the contracting office will provide DD 254 for completion.<BR><BR>If you have complaints about this procurement, it is preferable that you first attempt to resolve those concerns with the responsible contracting officer. However, you can also protest to Headquarters, AMC. The HQ, AMC-Level Protest Program is intended to encourage interested parties to seek resolution of their concerns within AMC as an Alternative Dispute Resolution forum, rather than filing a protest with the Government Accountability Office or other external forum. Contract award or performance is suspended during the protest to the same extent, and within the same time periods, as if filed at the GAO. The AMC protest decision goal is to resolve protests within 20 working days from filing. To be timely, protests must be filed within the periods specified in FAR 33.103. If you want to file a protest under the AMC-Level Protest Program, the protest must request resolution under that program and be sent to the address below. All other agency-level protests should be sent to the contracting officer for resolution.\r\n\r\nHQ Army Material Command\r\nOffice of Command Counsel\r\n9301 Chapek Rd, Room 2-1SE3401\r\nFt. Belvoir, VA 22060-5527\r\nFacsimile number (703) 806-8866 or 8875\r\n\r\nPackages sent by FedEx or UPS should be addressed to:\r\n[contract number]\r\nHQ Army Material Command\r\nOffice of Command Counsel\r\nRoom 2-1SE3401\r\n1412 Jackson Loop\r\nFt. Belvoir, VA 22060-5527\r\nThe AMC-Level Protest procedures are found at: http://www.amc.army.mil/pa/COMMANDCOUNSEL.asp. If internet access is not available, contact the contracting officer or HQ, AMC to obtain the AMC-Level Protest Procedures.<BR><BR>If an interested party have complaints about this procurement, it is preferable that you first attempt to resolve those concerns with the responsible contracting officer. However, you can also officially protest to the contracting officer. Contract award or performance is suspended during the protest. To be timely, protests must be filed within the periods specified in FAR 33.103. If an interested party has complaints or want to file a protest it must be sent to the address below:\r\n\r\nMission and Installation Contracting Command\r\nChief, Supply and Small Services Branch\r\nBOX 339500, MS 19\r\nJBLM, WA 98433-9500\r\nFacsimile number 253-967-3844<BR><BR>","LINK":"","URL":"https://www.fbo.gov/notices/c986b3b5bbae57a8b92bc2acbc00e17b","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"98433-5000","POPADDRESS":"JBLM, WA 98433"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Agriculture","OFFICE":"Forest Service","LOCATION":"R-8 Chattahoochee and Oconee National Forests","ZIP":"30501","CLASSCOD":"F","NAICS":"115310","OFFADD":"1755 Cleveland Highway Gainesville GA 30501","SUBJECT":"Gravel placement on Forest Service roads within the Chattooga River Ranger District, Chattahoochee National Forest.","SOLNBR":"12435H19Q0022","NTYPE":"COMBINE","RESPDATE":"072919","CONTACT":"Seung(Josh) Choi, Contract Specialist, Phone 7702973055, Email seung.choi@usda.gov","DESC":"1) This is combined synopsis/solicitation for commercial service prepared in accordance with the format in FAR Subpart 12.6, as supplemented with additional information included in this notice. This announcement constitutes the only solicitation; quotes are being requested and a written solicitation will not be issued. All businesses submitting an offer/quote must be registered on https://www.sam.gov, prior to award. Any amendments issued to this solicitation will ONLY be available on the FBO website (www.fbo.gov).<br />2) This solicitation is issued as a Request for Quotation (RFQ) and the solicitation number for this requirement is 12435H-19-Q-0022. This procurement is issued for 100% Small Business Set-aside. The associated NAICS code is 115310. The small business size standard is $7.500, 000.<br />3) This requirement is to perform gravel placement on Forest Service roads within the Chattooga River Ranger District, Chattahoochee National Forest.\r\n<p>4) Period of Performance: <br />90 days for completion after contract award <br />5) Location: Chattooga River Ranger District, Chattahoochee National Forest.</p>\r\n<p>5)The RFQ closing date is 29 July 2019 at 4:00 PM EST.</p>\r\n<p>6) All quotations shall be submitted electronically no later than 8 July 2019, 4:00PM, Eastern to the contract specialist at Contract Specialist: Mr. Seung (Josh) Choi at seung.choi@usda.gov</p>\r\n<p>&nbsp;</p>\r\n<p>If you have any questions, please contact Contract Specialist at seung.choi@usda.gov no later than 27 June 2019, 4:00PM, EST.</p>","LINK":"","URL":"https://www.fbo.gov/spg/USDA/FS/435H/12435H19Q0022/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPADDRESS":"Chattooga River Ranger District, Chattahoochee National Forest., GA"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Commerce","OFFICE":"National Institute of Standards and Technology (NIST)","LOCATION":"Acquisition Management Division","ZIP":"20899-1410","CLASSCOD":"P","NAICS":"562112","OFFADD":"100 Bureau Drive, Building 301\r\nRoom B130 Gaithersburg MD 20899-1410","SUBJECT":"Transformer Disposal Services","SOLNBR":"NB195000-19-00741","NTYPE":"COMBINE","RESPDATE":"060619","CONTACT":"Gina Lee, Contract Specialist, Phone 3019758334, Email gina.lee@nist.gov","DESC":"<p>The purpose of this amendment is to correct the misspelling of the Title of the posting.<br /><br />All other terms and conditions&nbsp;of the Combined Synopsis/Solicitation remain unchanged.<br /><br />&nbsp;</p>","LINK":"","URL":"https://www.fbo.gov/spg/DOC/NIST/AcAsD/NB195000-19-00741/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"20899","POPADDRESS":"National Institute of Standards and Technology\r\n100 Bureau Drive\r\n\nGaithersburg, MD"},{"DATE":"0509","YEAR":"19","AGENCY":"Department of Commerce","OFFICE":"National Institute of Standards and Technology (NIST)","LOCATION":"Acquisition Management Division","ZIP":"20899-1410","CLASSCOD":"P","NAICS":"562112","OFFADD":"100 Bureau Drive, Building 301\r\nRoom B130 Gaithersburg MD 20899-1410","SUBJECT":"Transformer Disposal Services","SOLNBR":"NB195000-19-00741","NTYPE":"COMBINE","RESPDATE":"060619","CONTACT":"Gina Lee, Contract Specialist, Phone 3019758334, Email gina.lee@nist.gov","DESC":"<p>The purpose of this amendment A002 is to provide guidance for the Site-Visit.</p>\r\n<p>An organized site-visit is scheduled for: <strong>5/23/2019 at 2:00 p.m. EST</strong> in Building 301, Cafeteria. Only one site-visit will be conducted. The Government request that the company signature authority and the project manager attend this site-visit.</p>\r\n<p>Please send a list of attendee(s) with the following information:</p>\r\n<p>Name (as it appears on you ID):<br />US Citizen: Yes or No<br />Company Name:</p>\r\n<p><strong>by 5/15/2019, 12:00 p.m.</strong> to Gina Lee at <span style=\"text-decoration: underline;\">gina.lee@nist.gov</span> so I may be able to request visitor access thru the front gate.</p>\r\n<p><strong>Visitors shall be appropriately dressed to climb stairs.</strong></p>\r\n<p>All other terms and conditions of the Combined Synopsis/Solicitation remain unchanged.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>","LINK":"","URL":"https://www.fbo.gov/spg/DOC/NIST/AcAsD/NB195000-19-00741/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"20899","POPADDRESS":"National Institute of Standards and Technology\r\n100 Bureau Drive\r\n\nGaithersburg, MD"},{"DATE":"0603","YEAR":"19","AGENCY":"Department of Commerce","OFFICE":"National Institute of Standards and Technology (NIST)","LOCATION":"Acquisition Management Division","ZIP":"20899-1410","CLASSCOD":"P","NAICS":"562112","OFFADD":"100 Bureau Drive, Building 301\r\nRoom B130 Gaithersburg MD 20899-1410","SUBJECT":"Transformer Disposal Services","SOLNBR":"NB195000-19-00741","NTYPE":"COMBINE","RESPDATE":"062019","CONTACT":"Gina Lee, Contract Specialist, Phone 3019758334, Email gina.lee@nist.gov","DESC":"<p>See attached file for Amendment A003.</p>\r\n<p>&nbsp;</p>","LINK":"","URL":"https://www.fbo.gov/spg/DOC/NIST/AcAsD/NB195000-19-00741/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"20899","POPADDRESS":"National Institute of Standards and Technology\r\n100 Bureau Drive\r\n\nGaithersburg, MD"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Commerce","OFFICE":"National Institute of Standards and Technology (NIST)","LOCATION":"Acquisition Management Division","ZIP":"20899-1410","CLASSCOD":"P","NAICS":"562112","OFFADD":"100 Bureau Drive, Building 301\r\nRoom B130 Gaithersburg MD 20899-1410","SUBJECT":"Solicitation is canceled for Transformer Disposal Services","SOLNBR":"NB195000-19-00741","NTYPE":"COMBINE","CONTACT":"Gina Lee, Contract Specialist, Phone 3019758334, Email gina.lee@nist.gov","DESC":"This solicitation is canceled.","LINK":"","URL":"https://www.fbo.gov/spg/DOC/NIST/AcAsD/NB195000-19-00741/listing.html","DESC2":"Link To Document","SETASIDE":"Total Small Business","POPCOUNTRY":"US","POPZIP":"20899","POPADDRESS":"National Institute of Standards and Technology\r\n100 Bureau Drive\r\n\nGaithersburg, MD"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Homeland Security","OFFICE":"United States Secret Service","LOCATION":"Procurement Division","ZIP":"20223","CLASSCOD":"X","NAICS":"812930","OFFADD":"245 MURRAY LANE SW\r\nBLDG T-5 WASHINGTON DC 20223","SUBJECT":"Parking Spaces","SOLNBR":"70US0919R70090013","NTYPE":"COMBINE","RESPDATE":"071719","CONTACT":"Michael B Velez, Contract Specialist, Phone 202-406-6940, Fax 202-406-6802, Email michael.velez@usss.dhs.gov","DESC":"The purpose of this amendment is to provide a response to a question.\r\n\r\nDoes the US Secret Service have an incumbent for these parking spaces? Response: The incumbents are Colonial Parking and Imperial Parking.","LINK":"","URL":"https://www.fbo.gov/spg/DHS/USSS/PDDC20229/70US0919R70090013/listing.html","DESC2":"Link To Document","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Technology Acquisition Center","LOCATION":"VA Technology Acquisition Center","ZIP":"07724","CLASSCOD":"D","NAICS":"517311","OFFADD":"Department of Veterans Affairs;Technology Acquisition Center;23 Christopher Way;Eatontown NJ  07724","SUBJECT":"D--55498 - Source Selection - Contract Puerto Rico Data and Voice (LEC)","SOLNBR":"36C10B19R0035","NTYPE":"COMBINE","RESPDATE":"071219","ARCHDATE":"09102019","CONTACT":"Amanda.Bleses@va.gov\n\n<a href=\"mailto:Amanda.Bleses@va.gov\">Amanda.Bleses@va.gov</a>","DESC":"The purpose of Amendment A0001, is to include the excel attachment of  Attachment C_SDP w-Inventory .\n\nThank you.","LINK":"","URL":"https://www.fbo.gov/notices/29f9833529e6f1e2861eed109b85adfb","DESC2":"Link To Document","EMAIL":"","EMAIL2":"Amanda.Bleses@va.gov","DESC3":"Amanda.Bleses@va.gov","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Interior","OFFICE":"Fish and Wildlife Service","LOCATION":"CGS-WO","ZIP":"01035","CLASSCOD":"Y","NAICS":"237990","OFFADD":"FWS, DIVISION OF CONTRACTING AND GE<br />300 WESTGATE CENTER DRIVE<br />SUITE 310<br />Hadley<br />MA<br />01035-9589<br />","SUBJECT":"Y--Hellcat Trail Boardwalk Replacement @ PR NWR","SOLNBR":"140F0519R0012","NTYPE":"PRESOL","RESPDATE":"072519","ARCHDATE":"08092019","CONTACT":"Conant, Laura\n\n<a href=\"mailto:laura_conant@fws.gov\">laura_conant@fws.gov</a>","DESC":"Hellcat Trail Boardwalk Replacement @ Parker River NWR\nAmendment 3 - Offer due date is extended to Thursday, July 25, 2019 (more)","LINK":"","URL":"https://www.fbo.gov/spg/DOI/FWS/CGSWO/140F0519R0012/listing.html","DESC2":"Link To Document","EMAIL":"","EMAIL2":"laura_conant@fws.gov","DESC3":"laura_conant@fws.gov","SETASIDE":"Competitive 8(a)","POPZIP":"01950-4315"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Long Beach VANLO","LOCATION":"Department of Veterans Affairs","ZIP":"90815","CLASSCOD":"Q","NAICS":"621498","OFFADD":"Department of Veterans Affairs;Network Contracting Office 22;4811 Airport Plaza Drive;Suite 600;Long Beach CA  90815","SUBJECT":"Q--VA Loma Linda Healthcare System- Community Based Outpatient Clinics (CBOCs)","SOLNBR":"36C26219R0026","NTYPE":"PRESOL","RESPDATE":"081619","ARCHDATE":"11232019","CONTACT":"Chelsea Black (Chief Div 1)\nSupervisory Contract Specialist\n562-766-2208\n\n<a href=\"mailto:chelsea.black@va.gov\">chelsea.black@va.gov</a>","DESC":"The pre-solicitation notice has been modified to change the solicitation release date.  The anticipated solicitation will be posted to www.fedbizopps.gov  on or about July 12, 2019.","LINK":"","URL":"https://www.fbo.gov/spg/VA/LBVANBC/VAMD/36C26219R0026/listing.html","DESC2":"Link To Document","EMAIL":"","EMAIL2":"chelsea.black@va.gov","DESC3":"chelsea.black@va.gov","SETASIDE":"N/A"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Interior","OFFICE":"Bureau of Indian Affairs","LOCATION":"BIA - DAPM","CLASSCOD":"Y","NAICS":"236220","OFFADD":"","SUBJECT":"Y--DESIGN AND CONSTRUCTION OF ROOF ON BLAYLOCK HALL","SOLNBR":"","CONTACT":"Littlechief, Jocelyn","AWDNBR":"140A1618D0005/140A0319F0020","AWDAMT":"$402,615.19","AWDDATE":"070519","ARCHDATE":"07202019","AWARDEE":"CHEROKEE CRC, LLC<br />10838 E MARSHALL STE 220<br />TULSA<br />OK<br />74116-5681<br />US","DESC":"DEISGN AND CONSTRUCTION OF ROOF ON BLALOCK HALL","LINK":"","URL":"https://www.fbo.gov/spg/DOI/BIA/RestonVA/Awards/140A1618D0005/140A0319F0020.html","DESC2":"Link To Document"},{"DATE":"0707","YEAR":"19","AGENCY":"Agency for International Development","OFFICE":"Overseas Missions","LOCATION":"Afghanistan USAID-Kabul","ZIP":"CHEROKEE CRC, LLC<br />10838 E MARSHALL STE 220<br />TULSA<br />OK<br />74116-5681<br />US","CLASSCOD":"Y","NAICS":"237130","OFFADD":"U.S. Agency for International Development (USAID)\r\nU.S. Embassy\r\nGreat Masood Road\r\nKabul, Afghanistan Kabul 1","SUBJECT":"Designing and Construction of the Southeast Power System (SEPS) Completion and the Northeast Power System-Southeast Power System (NEPS-SEPS) Connector Substation","SOLNBR":"72030618R00011","CONTACT":"Joseph C. Tembo, Senior Acquisition Specialist, Phone 260211254303, Email jtembo@usaid.gov - Sayed Saleem Wayezee, Acquisition & Assistance Specialist, Phone 93702646405, Email sswayezee@usaid.gov","AWDNBR":"72030619C00006","AWDAMT":"$159794733","AWDDATE":"070319","AWARDEE":"Zwakman Nabizai Construction Company, 3rd Road, Karte Se\r\n, Kabul, 1 24000 AF","DESC":"","LINK":"","URL":"https://www.fbo.gov/spg/AID/OM/AFG/Awards/72030619C00006.html","DESC2":"Link To Document"},{"DATE":"0707","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"US Army Medical Command","LOCATION":"REGIONAL HEALTH CONTR OFC PACIFIC","ZIP":"96858-5098","CLASSCOD":"65","NAICS":"339113","OFFADD":"ATTN: MCAA PC\r\nBLDG 339 CLARK ROAD FORT SHAFTER  HI 96858-5098","SUBJECT":"Notice of Intent for Sole Source Award for Total Joint/Hip Implants","SOLNBR":"W81K0219Q0200","NTYPE":"SNOTE","CONTACT":"Kendre M. Green, Purchasing Agent, Phone 3604860709, Email kendre.m.green.civ@mail.mil","AWDNBR":"W81K0219P0167","AWDAMT":"$100,000.00","AWDDATE":"070319","LINENBR":"0001-0002","AWARDEE":"Smith & Nephew","DESC":"","LINK":"","URL":"https://www.fbo.gov/spg/USA/MEDCOM/DADA16/W81K0219Q0200/listing.html","DESC2":"Link To Document"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"263 Network Contracting Office 23 (NCO 23)","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C26319Q0666","NTYPE":"AWARD","AWDNBR":"36C26319P0826","ARCHDATE":"07072019"},{"DATE":"0625","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"263 Network Contracting Office 23 (NCO 23)","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C26319Q0704","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0617","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"ACC OO","LOCATION":"ACC-AFG (W91B4N) RCC-AFG","SOLNBR":"W91B4N-19-R-MODFUEL","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0617","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"ACC OO","LOCATION":"ACC-AFG (W91B4N) RCC-AFG","SOLNBR":"W91B4N-19-R-MOIFUEL","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0628","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"Agency for Healthcare Research and Quality","LOCATION":"Contracts Management","SOLNBR":"AHRQ241065","NTYPE":"AWARD","AWDNBR":"75Q80119P00003","ARCHDATE":"07072019"},{"DATE":"0307","YEAR":"19","AGENCY":"Department of the Air Force","OFFICE":"Air Force Materiel Command","LOCATION":"AFLCMC / AFSC / AFNWC - HILL AFB","SOLNBR":"SPRHA4-19-Q-0899","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0306","YEAR":"19","AGENCY":"Department of the Air Force","OFFICE":"Air Force Materiel Command","LOCATION":"AFLCMC / AFSC / AFNWC - HILL AFB","SOLNBR":"SPRHA4-19-Q-0938","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of the Air Force","OFFICE":"Air Force Materiel Command","LOCATION":"AFLCMC / AFSC / AFNWC - HILL AFB","SOLNBR":"FA822419Q7200","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of the Air Force","OFFICE":"Air Force Materiel Command","LOCATION":"AFLCMC/PZIO - WPAFB","SOLNBR":"FA8601-19-R-0002","NTYPE":"AWARD","AWDNBR":"FA8601-19-C-A033","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of the Air Force","OFFICE":"Air Force Materiel Command","LOCATION":"AFRL/RIK -  Rome","SOLNBR":"FA8751-19-Q-0382","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0509","YEAR":"19","AGENCY":"Department of the Air Force","OFFICE":"Air Force Materiel Command","LOCATION":"PK/PZ - Robins AFB","SOLNBR":"FA8539-19-R-0015","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of the Air Force","OFFICE":"Air Force Materiel Command","LOCATION":"PK/PZ Tinker AFB","SOLNBR":"SPRTA1-19-R-0329","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0501","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Alexandria VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C25619Q0781","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"Army Contracting Command","LOCATION":"ACC - APG (W911QY) Natick (SPS)","SOLNBR":"0011344311","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0524","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Augusta VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24719R0103","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Brecksville (Cleveland) VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C25019Q0907","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0524","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Bronx VAMC (NAL)","LOCATION":"Department of Veterans Affairs","SOLNBR":"36C24219Q0709","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0627","YEAR":"19","AGENCY":"Department of Energy","OFFICE":"Brookhaven National Laboratory (DOE Contractor)","LOCATION":"Brookhaven","SOLNBR":"366971","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0627","YEAR":"19","AGENCY":"Department of Energy","OFFICE":"Brookhaven National Laboratory (DOE Contractor)","LOCATION":"Brookhaven","SOLNBR":"366922","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0104","YEAR":"19","AGENCY":"Department of the Interior","OFFICE":"Bureau of Indian Affairs","LOCATION":"BIA - DAPM","SOLNBR":"140A1619Q0009_01","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0620","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Bureau of Medicine and Surgery","LOCATION":"Naval Medical Logistics Command","SOLNBR":"N6264519R0063","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0626","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Bureau of Medicine and Surgery","LOCATION":"Naval Medical Research Center","SOLNBR":"N3239819QE0029","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0627","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Bureau of Medicine and Surgery","LOCATION":"Naval Medical Research Center","SOLNBR":"N3239819QA026","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0626","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Bureau of Medicine and Surgery","LOCATION":"Naval Medical Research Center","SOLNBR":"N3239819QD015","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0627","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Bureau of Medicine and Surgery","LOCATION":"Naval Medical Research Center","SOLNBR":"N3239819QE035","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0626","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Bureau of Medicine and Surgery","LOCATION":"Naval Medical Research Center","SOLNBR":"N3239819QE028","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0103","YEAR":"19","AGENCY":"Department of Justice","OFFICE":"Bureau of Prisons","LOCATION":"Acquisitions Branch","SOLNBR":"15b21519q0000055","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0107","YEAR":"19","AGENCY":"Department of Justice","OFFICE":"Bureau of Prisons","LOCATION":"Field Acquisition Office (FAO)","SOLNBR":"FAOJFC191GRE","NTYPE":"JA","ARCHDATE":"07072019"},{"DATE":"0610","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"Centers for Disease Control and Prevention","LOCATION":"Procurement and Grants Office (Atlanta)","SOLNBR":"34039","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0625","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Charleston VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24719Q0683","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0504","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Cincinnati VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C25019Q0715","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0313","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Columbus VAOPC","LOCATION":"Department of Veterans Affairs Outpatient Clinic","SOLNBR":"36C25019R0051","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation","SOLNBR":"SPE4A6-19-R-X161","NTYPE":"AWARD","AWDNBR":"SPE4A6-19-D-6802","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T356B","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T581L","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T353J","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T353H","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T353R","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13P1","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0407","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A019T1431","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0407","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T809Q","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T285P","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0507","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T286N","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619U0437","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13L9","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0407","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T397A","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T953F","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T580S","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13S1","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13U0","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A419T7412","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1020","YEAR":"18","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519R0083","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T577Q","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T580G","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T11R8","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13M0","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T590V","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519Q0985","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0610","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A5-19-R-0199","NTYPE":"JA","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T285H","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T580P","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T364E","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13P0","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T364P","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T365P","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719Q1545","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0407","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T391H","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0505","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T468H","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13V0","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619Q1513","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0524","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719Q1519","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T580N","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T354Z","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13V3","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0605","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619Q1530","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0407","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T389A","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0407","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T394C","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0407","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T820F","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T579L","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A719T353U","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A619T13S7","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Aviation - BSM","SOLNBR":"SPE4A519T591M","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0107","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime","SOLNBR":"SPMYM219Q0776","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T311X","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319T235J","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M519T452R","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0523","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M519Q0978","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L719T4279","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7MC19T030E","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M419T8011","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0523","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7MC19Q0524","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L519T3738","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319T235L","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319T235K","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0523","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7MC19Q0526","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M819T5121","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M419T8626","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0524","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119Q0540","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L719T4275","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M019T9723","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7MC19T029S","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L419T3355","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L719T4277","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7MC19T030D","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7MC19T030C","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319Q0793","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T239U","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319T290A","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M519T519R","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319Q0803","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPMYM219Q2052","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L719U0042","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T310S","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319T235M","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0524","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M819Q0166","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T310N","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L719Q0430","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M519T522H","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0523","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119Q0539","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T310J","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T311A","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M519T520N","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M919T0777","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319T235W","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T310L","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M219T3736","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M319T007X","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M519T518G","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T311V","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T311W","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L719T4276","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M919T0859","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L119T206Q","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7L319Q0798","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M319T007W","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - BSM","SOLNBR":"SPE7M119T310P","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0605","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Land and Maritime - Philadelphia Detachment","SOLNBR":"SPEFA119Q0301","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E419T004W","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E319T233G","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5EM19T7868","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5EK19T078J","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E319T234G","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5EC19T1229","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5EK19T078C","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E719T046Q","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E719T046Y","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E919T7460","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E319T235L","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E919U0014","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5EC19T1230","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E819T020Z","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5E919T7443","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Construction & Equipment - BSM","SOLNBR":"SPE5EC19T1224","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E519T3768","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8ED19Q0609","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0604","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E819Q0136","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E519T3767","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E819T3504","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E619T1434","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0529","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E719Q0197","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0604","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8ED19Q0616","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E919T2706","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8EE19T1803","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8E719T3280","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0527","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8EF19T1567","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0603","YEAR":"19","AGENCY":"Defense Logistics Agency","OFFICE":"DLA Acquisition Locations","LOCATION":"DLA Troop Support - Medical - BSM","SOLNBR":"SPE8ED19Q0614","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1217","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"POPE43AESFB0002","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1219","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"SILL434KJR0020","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0107","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"LEETJA0008","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0103","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"KNOXUSARECG4-SJM0011","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0103","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"KNOXUSARECG4-SJM0012","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1220","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"DPGCTDTS181220a","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1221","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"PAN408-19-P-0000000680","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1219","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"Reforestation_11274662","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1218","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"833301G2","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1129","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"W911SD-19-R-0027","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1220","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"DPGCTDTS181220c","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0104","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"BENNING211PARRILLA02","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1220","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"DPGTSDTS181220c","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1220","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"DPGCTDTS181220d","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0104","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"SILLG8MMA0002","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1213","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"CARSONDPWCG0011","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1213","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"CARSONDPWCG0012","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1220","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"DPGOPDTS181220a","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0103","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"KNOXUSARECG4-SJM0008","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1220","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"DPGTSDTS181220d","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0103","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"KNOXUSARECG4-SJM0010","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0104","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"HAAF175AML0090","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0103","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"KNOXUSARECG4-SJM0009","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0104","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"W91ZLK-19-Q-0008","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1213","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"CARSONDPWCG0013_01","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1219","YEAR":"18","AGENCY":"Department of the Army","OFFICE":"FedBid","LOCATION":"FedBid.com -- for Department of Army procurements only","SOLNBR":"DPGTSDTS181219a","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"General Services Administration","OFFICE":"Federal Acquisition Service (FAS)","LOCATION":"Federal Systems Integration&Management Center(FEDSIM)(QFOB)","SOLNBR":"47QFCA19K0039","NTYPE":"AWARD","AWDNBR":"47QFCA19F0057","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of Justice","OFFICE":"Federal Bureau of Investigation","LOCATION":"Procurement Section","SOLNBR":"DJF-17-1200-G-0007225","NTYPE":"JA","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Fresno VAMC","LOCATION":"Department of Veterans Affairs Central California Health Care System","SOLNBR":"36C26119Q0698","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0503","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Hampton VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24619Q0543","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0521","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Houston VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C25619Q0826","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0604","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"Indian Health Service","LOCATION":"Aberdeen Area Office","SOLNBR":"","NTYPE":"JA","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Indianapolis VAMC","LOCATION":"Richard L. Roudebush Department of Veterans Affairs Medical Center","SOLNBR":"36C25019Q0736","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0520","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Jackson VAMC","LOCATION":"G.V. (Sonny) Montgomery Department of Veterans Affairs Medical Center","SOLNBR":"36C25619Q0893","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Long Beach VANLO","LOCATION":"Department of Veterans Affairs","SOLNBR":"36C26219Q0624","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0603","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Long Beach VANLO","LOCATION":"Department of Veterans Affairs","SOLNBR":"36C26219Q0783","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Manchester VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24119AP1818","NTYPE":"JA","ARCHDATE":"07072019"},{"DATE":"0424","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Martinsburg VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24519Q0281","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0318","YEAR":"19","AGENCY":"Millennium Challenge Corporation","OFFICE":"MCC","LOCATION":"Washington DC","SOLNBR":"RFPMFK2019QCBSNo006","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0419","YEAR":"19","AGENCY":"Millennium Challenge Corporation","OFFICE":"MCC","LOCATION":"Washington DC","SOLNBR":"LCSMCAMES34Compact","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Nashville VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24919Q0263","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"National Institutes of Health","LOCATION":"National Institute of Child Health and Human Development","SOLNBR":"NICHD-19-094","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"National Institutes of Health","LOCATION":"National Institute of Child Health and Human Development","SOLNBR":"NICHD-19-089","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"National Institutes of Health","LOCATION":"National Institute of Child Health and Human Development","SOLNBR":"NICHD-19-091","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"National Institutes of Health","LOCATION":"National Institute on Drug Abuse","SOLNBR":"75N95019Q00189","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Department of Health and Human Services","OFFICE":"National Institutes of Health","LOCATION":"National Institute on Drug Abuse","SOLNBR":"75N95019Q00191","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"1024","YEAR":"18","AGENCY":"Department of the Navy","OFFICE":"Naval Air Systems Command","LOCATION":"Naval Air Warfare Center Aircraft Division Lakehurst","SOLNBR":"N68335-19-Q-0046","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1219","YEAR":"18","AGENCY":"Department of the Navy","OFFICE":"Naval Air Systems Command","LOCATION":"Naval Air Warfare Center Aircraft Division Lakehurst","SOLNBR":"N6833519Q0104","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1024","YEAR":"18","AGENCY":"Department of the Navy","OFFICE":"Naval Air Systems Command","LOCATION":"Naval Air Warfare Center Aircraft Division Lakehurst","SOLNBR":"N68335-19-Q-0045","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0529","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Information Warfare Systems Command","LOCATION":"Naval Information Warfare Center Atlantic","SOLNBR":"N65236-19-Q-7610","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0601","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Information Warfare Systems Command","LOCATION":"Naval Information Warfare Center Pacific","SOLNBR":"N66001-19-Q-6514","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0604","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Information Warfare Systems Command","LOCATION":"Naval Information Warfare Center Pacific","SOLNBR":"N66001-19-Q-6526","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0507","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Sea Systems Command","LOCATION":"NSWC Panama City Divison","SOLNBR":"N6133119QVT29","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0104","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Fleet Logistics Center Jacksonville","SOLNBR":"N68836-19-Q-0068","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0522","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Fleet Logistics Center Norfolk Groton Office","SOLNBR":"N0018919QG103","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Fleet Logistics Center Puget Sound","SOLNBR":"N0040619Q0069","NTYPE":"AWARD","AWDNBR":"N0040619C0009","ARCHDATE":"07072019"},{"DATE":"0102","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Fleet Logistics Center San Diego","SOLNBR":"N0024419Q0058","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0103","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Fleet Logistics Center San Diego","SOLNBR":"N0024419Q0059","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"1126","YEAR":"18","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Weapon Systems Support Mechanicsburg PA","SOLNBR":"N0010419RBD45","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"1207","YEAR":"18","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Weapon Systems Support Mechanicsburg PA","SOLNBR":"N271538323A121_N271538323A122_N271538323A123","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0620","YEAR":"19","AGENCY":"Department of the Navy","OFFICE":"Naval Supply Systems Command","LOCATION":"NAVSUP Weapon Systems Support Philadelphia PA","SOLNBR":"N0038319Q067H","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0408","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Network Contracting Office 4","LOCATION":"Veterans Integrated Service Network 4 Facilities","SOLNBR":"36C24419R0012","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0501","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"New Orleans VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C25619Q0779","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Orlando VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24819Q0745","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0327","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Phoenix VAMC","LOCATION":"Carl T. Hayden Department of Veterans Affairs Medical Center","SOLNBR":"36C25819Q0172","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0603","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Portland VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C26019Q0471","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0606","YEAR":"19","AGENCY":"General Services Administration","OFFICE":"Public Buildings Service (PBS)","LOCATION":"R10 Design & Construction Contracting  (47PL01)","SOLNBR":"EQ10PCPC-19-0001","NTYPE":"JA","ARCHDATE":"07072019"},{"DATE":"0524","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Shreveport VAMC","LOCATION":"Overton Brooks Department of Veterans Affairs Medical Center","SOLNBR":"36C25619Q0911","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Syracuse VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24219Q0670","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0503","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"Syracuse VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24219Q0652","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0523","YEAR":"19","AGENCY":"Department of Homeland Security","OFFICE":"Transportation Security Administration","LOCATION":"Headquarters TSA","SOLNBR":"70T02019Q9NNCP027","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of the Army","OFFICE":"US Army Medical Research Acquisition Activity","LOCATION":"U.S. Army Medical Research Acquisition Activity","SOLNBR":"W81XWH-19-Q-0196","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Bay Pines Health Care System","LOCATION":"Department of Veterans Affairs Bay Pines Health Care System","SOLNBR":"36C24819Q0848","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Boston Healthcare System","LOCATION":"Department of Veterans Affairs Boston Healthcare System","SOLNBR":"36C24119Q0267","NTYPE":"AWARD","AWDNBR":"36C24119P0615","ARCHDATE":"07072019"},{"DATE":"0627","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Corporate Franchise Data Center","LOCATION":"Department of Veterans Affairs Corporate Franchise Data Center","SOLNBR":"36C77619Q0160","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0516","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0600","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0607","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0517","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0154","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0523","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0620","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0604","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0553","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0515","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0584","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0430","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0499","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0575","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0612","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0386","NTYPE":"AWARD","AWDNBR":"36C25219C0160","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0421","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Great Lakes Healthcare System","LOCATION":"Department of Veterans Affairs Great Lakes Healthcare System","SOLNBR":"36C25219Q0578","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0523","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Heartland Network","LOCATION":"Department of Veterans Affairs Heartland Network","SOLNBR":"36C25519Q0473","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0516","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Heartland Network","LOCATION":"Department of Veterans Affairs Heartland Network","SOLNBR":"36C25519Q0467","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0604","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Heartland Network","LOCATION":"Department of Veterans Affairs Heartland Network","SOLNBR":"36C25519Q0400","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0620","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Maryland Health Care System","LOCATION":"Department of Veterans Affairs Health Care System","SOLNBR":"36C24519Q0405","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Maryland Health Care System","LOCATION":"Department of Veterans Affairs Health Care System","SOLNBR":"36C24519Q0375","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Maryland Health Care System","LOCATION":"Department of Veterans Affairs Health Care System","SOLNBR":"36C24519Q0377","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0627","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Miami Health Care System","LOCATION":"Department of Veterans Affairs Miami Health Care System","SOLNBR":"36C24819Q0953","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0510","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Acquisition Center","LOCATION":"Department of Veterans Affairs National Acquisition Center","SOLNBR":"36h79719r0001","NTYPE":"AWARD","AWDNBR":"36H79719C0007","ARCHDATE":"07072019"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Cemetery Administration Centralized Contracting Division","LOCATION":"Department of Veterans Affairs National Cemetery Administration","SOLNBR":"36C78619Q0277","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Cemetery Administration Centralized Contracting Division","LOCATION":"Department of Veterans Affairs National Cemetery Administration","SOLNBR":"36C78619Q0279","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0503","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Cemetery Administration Centralized Contracting Division","LOCATION":"Department of Veterans Affairs National Cemetery Administration","SOLNBR":"36C78619Q0283","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0422","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Cemetery Administration Centralized Contracting Division","LOCATION":"Department of Veterans Affairs National Cemetery Administration","SOLNBR":"36C78619Q0260","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Consolidated Mail Outpatient","LOCATION":"VA National Consolidated Mail Out Pharmacy","SOLNBR":"36C77019Q0456","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Consolidated Mail Outpatient","LOCATION":"VA National Consolidated Mail Out Pharmacy","SOLNBR":"36C77019Q0465","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0605","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Consolidated Mail Outpatient","LOCATION":"VA National Consolidated Mail Out Pharmacy","SOLNBR":"36C77019Q0534","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0506","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Consolidated Mail Outpatient","LOCATION":"VA National Consolidated Mail Out Pharmacy","SOLNBR":"36C77019Q0438","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0408","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA National Energy Business Center","LOCATION":"VA National Energy Business Center","SOLNBR":"36E77619Q0058","NTYPE":"SNOTE","ARCHDATE":"07072019"},{"DATE":"0311","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA North Texas Health Care System","LOCATION":"Department of Veterans Affairs No. Texas Health Care System","SOLNBR":"36C25719Q0214","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0508","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Northern California Health Care System","LOCATION":"Department of Veterans Affairs No. California Health Care System System","SOLNBR":"36C26119Q0606","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0621","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Palo Alto Health Care System","LOCATION":"Department of Veterans Affairs Palo Alto Health Care System","SOLNBR":"36C26119Q0741","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0621","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Palo Alto Health Care System","LOCATION":"Department of Veterans Affairs Palo Alto Health Care System","SOLNBR":"36C26119Q0797","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0524","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Rocky Mountain Consolidated Contracting Center","LOCATION":"Department of Veterans Affairs","SOLNBR":"36C25919Q0294","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0401","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA South Texas Health Care System","LOCATION":"Department of Veterans Affairs South Texas Health Care System","SOLNBR":"36C25719Q0521","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA South Texas Health Care System","LOCATION":"Department of Veterans Affairs South Texas Health Care System","SOLNBR":"36C25719Q0809","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0530","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA South Texas Health Care System","LOCATION":"Department of Veterans Affairs South Texas Health Care System","SOLNBR":"36C25719Q0835","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0531","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA South Texas Health Care System","LOCATION":"Department of Veterans Affairs South Texas Health Care System","SOLNBR":"36C25719Q0828","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0514","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA West Texas Health Care System","LOCATION":"Department of Veterans Affairs West Texas Health Care System","SOLNBR":"36C25719Q0748","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VA Western New York Health Care System","LOCATION":"Department of Veterans Affairs Western New York Health Care System","SOLNBR":"36C24219Q0647","NTYPE":"SRCSGT","ARCHDATE":"07072019"},{"DATE":"0319","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VBA Office of Acquisition","LOCATION":"Department of Veterans Affairs Washington Regional Office","SOLNBR":"36C10E19R0006","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0521","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"VBA Office of Acquisition","LOCATION":"Department of Veterans Affairs Washington Regional Office","SOLNBR":"36C10E19Q0177","NTYPE":"PRESOL","ARCHDATE":"07072019"},{"DATE":"0404","YEAR":"19","AGENCY":"Department of Veterans Affairs","OFFICE":"West Palm Beach VAMC","LOCATION":"Department of Veterans Affairs Medical Center","SOLNBR":"36C24819Q0421","NTYPE":"COMBINE","ARCHDATE":"07072019"},{"DATE":"0502","YEAR":"19","AGENCY":"Department of Commerce","OFFICE":"National Institute of Standards and Technology (NIST)","LOCATION":"Acquisition Management Division","SOLNBR":"NB195000-19-00741","NTYPE":"COMBINE","ARCHDATE":"07072019"}]